NNdroid/esp32s3-remote-display/main/main.c
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <errno.h> // 用于 Socket 错误码处理
#include <dirent.h>
#include <sys/stat.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/event_groups.h"
#include "esp_log.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_netif.h"
#include "esp_mac.h"
#include "lwip/sockets.h"
#include <esp_http_server.h>
#include "esp_ota_ops.h"
#include "esp_https_ota.h"
#include <sys/param.h>
#include <time.h>
#include "esp_sntp.h"
#include "esp_task_wdt.h"

#ifndef PROJECT_VER
#define PROJECT_VER "unknown"
#endif

// 空闲钩子组件头文件
#include "esp_freertos_hooks.h"

// 蓝牙配网库
#include "network_provisioning/manager.h"
#include "network_provisioning/scheme_ble.h"

// 硬件核心驱动
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_ili9341.h"
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "driver/spi_master.h"
#include "driver/ledc.h"
#include "led_strip.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"

#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "driver/i2s_std.h"
#else
#include "driver/i2s.h"
#endif

#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
#define MY_ADC_ATTEN ADC_ATTEN_DB_12
#else
#define MY_ADC_ATTEN ADC_ATTEN_DB_11
#endif

// 高性能解码器
#include "esp_jpeg_dec.h"
#include "esp_jpeg_enc.h"
#include <math.h>

#define FRAME_BUF_SIZE 122880

// 屏幕分辨率
#define LCD_WIDTH 320
#define LCD_HEIGHT 240
#define LCD_PIXELS (LCD_WIDTH * LCD_HEIGHT)

#define LCD_HOST SPI2_HOST
#define TFT_MISO 13
#define TFT_MOSI 11
#define TFT_SCK 12
#define TFT_CS 10
#define TFT_DC 46
#define TFT_RST -1
#define TFT_BL 45

#define DISPLAY_BUF_NUM 1
#define RX_BUF_NUM 4

// SD 卡引脚定义 (请根据你的硬件连接修改)
#define SD_PIN_CLK 38
#define SD_PIN_CMD 40
#define SD_PIN_D0 39
#define SD_PIN_D1 41
#define SD_PIN_D2 48
#define SD_PIN_D3 47

#define MOUNT_POINT "/sdcard"

#define RGB_LED_PIN 42

// Audio I2S Pins
#define PA_EN_PIN 1
#define I2S_MCLK_PIN 4
#define I2S_BCLK_PIN 5
#define I2S_DOUT_PIN 8
#define I2S_LRCK_PIN 7
#define I2S_DIN_PIN -1 // 不需要麦克风输入，设为 -1 释放引脚

#define I2C_SDA_PIN 16
#define I2C_SCL_PIN 15

// ==================== 全局状态与持久化配置 ====================
volatile int g_current_fps = 0;
volatile int8_t g_current_rssi = 0;

volatile int32_t g_current_brightness = 60;
volatile int32_t g_current_volume = 80;
volatile int8_t g_show_osd = 1;
volatile bool g_show_time_osd = true;
volatile int8_t g_mirror_x = 0;
volatile int8_t g_mirror_y = 0;
volatile int8_t g_auto_sleep_enable = 1;
volatile int8_t g_alarm_enable = 0;
volatile int8_t g_alarm_hour = 8;
volatile int8_t g_alarm_min = 0;
volatile int8_t g_hourly_chime_enable = 1;
static volatile uint32_t g_idle_seconds = 0;
static volatile bool g_is_sleeping = false;
static int s_last_chime_hour = -1;
static int s_last_alarm_min = -1;
static volatile uint32_t s_chime_banner_until = 0;
static char s_chime_banner_str[64] = {0};
static volatile bool g_mirror_update_pending = false;
char g_admin_user[32] = "admin";
char g_admin_pwd[64] = "123456";
char g_device_ip[20] = "0.0.0.0";
char g_device_ip6[40] = "0000:0000:0000:0000:0000:0000:0000:0000";
char g_timezone[32] = "CST-8";

volatile int32_t g_udp_port = 8888;

volatile bool g_is_provisioning = false;
volatile bool g_sd_card_mounted = false;
volatile bool g_is_playing_from_sd = false;
volatile bool g_stop_playback = false;
volatile bool g_pause_playback = false;

volatile uint32_t g_sd_file_size = 0;
volatile uint32_t g_sd_current_pos = 0;
volatile int g_seek_permille = -1; // 用千分比来做细粒度的精度控制 (0~1000)

volatile uint8_t g_rgb_r = 0, g_rgb_g = 0, g_rgb_b = 0;
char g_syslog_host[64] = "";
volatile int8_t g_syslog_enable = 0;

volatile int8_t g_audio_enable = 1;

// 网络质量监控
volatile uint32_t g_video_packet_drop_count = 0;
volatile uint32_t g_audio_plc_count = 0; // 音频丢包补偿 (Packet Loss Concealment) 触发次数

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
static i2s_chan_handle_t tx_chan;
#endif

static TaskHandle_t s_sd_playback_task_handle = NULL;
static char s_playback_filename[128];

static i2c_master_dev_handle_t es8311_dev_handle = NULL;

volatile int g_battery_voltage_mv = 0;
volatile int g_battery_percentage = 0;
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static adc_cali_handle_t adc1_cali_handle = NULL;
static bool do_calibration = false;

char g_prov_pop[9] = "";
uint8_t g_prov_uuid[16] = {0};

static EventGroupHandle_t s_wifi_event_group;
#define WIFI_CONNECTED_BIT BIT0
static int s_retry_num = 0;

// ==================== CPU 负载与系统监控非同步全局变量 ====================
volatile uint32_t g_core0_idle_cnt = 0;
volatile uint32_t g_core1_idle_cnt = 0;

uint32_t g_core0_max_idle = 0;
uint32_t g_core1_max_idle = 0;

volatile int g_core0_usage = 0;
volatile int g_core1_usage = 0;

// 讓 Core 0 代為跑沉重的 API，Core 1 解碼達到 0 延自由阻礙
volatile uint32_t g_async_free_heap_kb = 0;
volatile int8_t g_async_wifi_rssi = 0;
volatile char g_async_wifi_bssid[20] = {0};
volatile uint32_t g_rx_bytes_1s = 0;
volatile uint32_t g_current_rx_speed_kbps = 0;

// 统一的 FreeRTOS 空闲钩子函数
bool vApplicationIdleHookCore(void)
{
    BaseType_t core_id = xPortGetCoreID();
    if (core_id == 0)
    {
        g_core0_idle_cnt++;
    }
    else if (core_id == 1)
    {
        g_core1_idle_cnt++;
    }
    return true;
}

// ==================== 引入 HTML 静态档案 ====================
extern const uint8_t index_html_start[] asm("_binary_index_html_start");
extern const uint8_t index_html_end[] asm("_binary_index_html_end");
extern const uint8_t login_html_start[] asm("_binary_login_html_start");
extern const uint8_t login_html_end[] asm("_binary_login_html_end");

static led_strip_handle_t s_led_strip = NULL;
static sdmmc_card_t *s_card;

// ==================== 辅助工具函数声明与实现 ====================
static void url_decode_safe(char *dst, const char *src, size_t max_len)
{
    char a, b;
    size_t written = 0;
    while (*src && (written < max_len - 1))
    {
        if ((*src == '%') && ((a = src[1]) && (b = src[2])) && (isxdigit(a) && isxdigit(b)))
        {
            if (a >= 'a')
                a -= 'a' - 'A';
            else if (a >= 'A')
                a -= ('A' - 10);
            else
                a -= '0';
            if (b >= 'a')
                b -= 'a' - 'A';
            else if (b >= 'A')
                b -= ('A' - 10);
            else
                b -= '0';
            *dst++ = 16 * a + b;
            src += 3;
        }
        else if (*src == '+')
        {
            *dst++ = ' ';
            src++;
        }
        else
        {
            *dst++ = *src++;
        }
        written++;
    }
    *dst = '\0';
}

// OSD 字模点阵库
static const uint8_t font8x8[96][8] = {
    {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}, {0x18, 0x3C, 0x3C, 0x18, 0x18, 0x00, 0x18, 0x00}, {0x6C, 0x6C, 0x6C, 0x00, 0x00, 0x00, 0x00, 0x00}, {0x6C, 0x6C, 0xFE, 0x6C, 0xFE, 0x6C, 0x6C, 0x00}, {0x18, 0x7E, 0x60, 0x7C, 0x06, 0x7E, 0x18, 0x00}, {0x00, 0x63, 0x66, 0x0C, 0x18, 0x33, 0x63, 0x00}, {0x1C, 0x36, 0x1C, 0x6E, 0x7B, 0x36, 0x71, 0x00}, {0x18, 0x18, 0x18, 0x00, 0x00, 0x00, 0x00, 0x00}, {0x0C, 0x18, 0x30, 0x30, 0x30, 0x18, 0x0C, 0x00}, {0x30, 0x18, 0x0C, 0x0C, 0x0C, 0x18, 0x30, 0x00}, {0x00, 0x12, 0x3F, 0x1E, 0x3F, 0x12, 0x00, 0x00}, {0x00, 0x18, 0x18, 0x7E, 0x18, 0x18, 0x00, 0x00}, {0x00, 0x00, 0x00, 0x00, 0x00, 0x18, 0x18, 0x30}, {0x00, 0x00, 0x00, 0x7E, 0x00, 0x00, 0x00, 0x00}, {0x00, 0x00, 0x00, 0x00, 0x00, 0x18, 0x18, 0x00}, {0x00, 0x06, 0x0C, 0x18, 0x30, 0x60, 0x00, 0x00}, {0x3C, 0x66, 0x6E, 0x76, 0x66, 0x66, 0x3C, 0x00}, {0x18, 0x38, 0x18, 0x18, 0x18, 0x18, 0x7E, 0x00}, {0x3C, 0x66, 0x06, 0x1C, 0x30, 0x66, 0x7E, 0x00}, {0x3C, 0x66, 0x06, 0x1C, 0x06, 0x66, 0x3C, 0x00}, {0x0C, 0x1C, 0x3C, 0x6C, 0x7E, 0x0C, 0x0C, 0x00}, {0x7E, 0x60, 0x7C, 0x06, 0x06, 0x66, 0x3C, 0x00}, {0x3C, 0x66, 0x60, 0x7C, 0x66, 0x66, 0x3C, 0x00}, {0x7E, 0x06, 0x0C, 0x18, 0x30, 0x30, 0x30, 0x00}, {0x3C, 0x66, 0x66, 0x3C, 0x66, 0x66, 0x3C, 0x00}, {0x3C, 0x66, 0x66, 0x3E, 0x06, 0x66, 0x3C, 0x00}, {0x00, 0x18, 0x18, 0x00, 0x00, 0x18, 0x18, 0x00}, {0x00, 0x18, 0x18, 0x00, 0x00, 0x18, 0x18, 0x30}, {0x06, 0x0C, 0x18, 0x30, 0x18, 0x0C, 0x06, 0x00}, {0x00, 0x00, 0x7E, 0x00, 0x7E, 0x00, 0x00, 0x00}, {0x60, 0x30, 0x18, 0x0C, 0x18, 0x30, 0x60, 0x00}, {0x3C, 0x66, 0x06, 0x1C, 0x18, 0x00, 0x18, 0x00}, {0x3C, 0x66, 0x6E, 0x6E, 0x60, 0x62, 0x3C, 0x00}, {0x18, 0x3C, 0x66, 0x66, 0x7E, 0x66, 0x66, 0x00}, {0x7C, 0x66, 0x66, 0x7C, 0x66, 0x66, 0x7C, 0x00}, {0x3C, 0x66, 0x60, 0x60, 0x60, 0x66, 0x3C, 0x00}, {0x78, 0x6C, 0x66, 0x66, 0x66, 0x6C, 0x78, 0x00}, {0x7E, 0x60, 0x60, 0x78, 0x60, 0x60, 0x7E, 0x00}, {0x7E, 0x60, 0x60, 0x78, 0x60, 0x60, 0x60, 0x00}, {0x3C, 0x66, 0x60, 0x6E, 0x66, 0x66, 0x3E, 0x00}, {0x66, 0x66, 0x66, 0x7E, 0x66, 0x66, 0x66, 0x00}, {0x3C, 0x18, 0x18, 0x18, 0x18, 0x18, 0x3C, 0x00}, {0x06, 0x06, 0x06, 0x06, 0x06, 0x66, 0x3C, 0x00}, {0x66, 0x6C, 0x78, 0x70, 0x78, 0x6C, 0x66, 0x00}, {0x60, 0x60, 0x60, 0x60, 0x60, 0x60, 0x7E, 0x00}, {0x63, 0x77, 0x7F, 0x6B, 0x63, 0x63, 0x63, 0x00}, {0x66, 0x76, 0x7E, 0x7E, 0x6E, 0x66, 0x66, 0x00}, {0x3C, 0x66, 0x66, 0x66, 0x66, 0x66, 0x3C, 0x00}, {0x7C, 0x66, 0x66, 0x7C, 0x60, 0x60, 0x60, 0x00}, {0x3C, 0x66, 0x66, 0x66, 0x66, 0x6E, 0x3E, 0x00}, {0x7C, 0x66, 0x66, 0x7C, 0x78, 0x6C, 0x66, 0x00}, {0x3C, 0x66, 0x60, 0x3C, 0x06, 0x66, 0x3C, 0x00}, {0x7E, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x00}, {0x66, 0x66, 0x66, 0x66, 0x66, 0x66, 0x3C, 0x00}, {0x66, 0x66, 0x66, 0x66, 0x66, 0x3C, 0x18, 0x00}, {0x63, 0x63, 0x6B, 0x7F, 0x77, 0x63, 0x63, 0x00}, {0x66, 0x66, 0x3C, 0x18, 0x3C, 0x66, 0x66, 0x00}, {0x66, 0x66, 0x66, 0x3C, 0x18, 0x18, 0x18, 0x00}, {0x7E, 0x06, 0x0C, 0x18, 0x30, 0x60, 0x7E, 0x00}, {0x3C, 0x30, 0x30, 0x30, 0x30, 0x30, 0x3C, 0x00}, {0x00, 0x60, 0x30, 0x18, 0x0C, 0x06, 0x00, 0x00}, {0x3C, 0x0C, 0x0C, 0x0C, 0x0C, 0x0C, 0x3C, 0x00}, {0x18, 0x3C, 0x66, 0x00, 0x00, 0x00, 0x00, 0x00}, {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFF}, {0x18, 0x18, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}, {0x00, 0x00, 0x3C, 0x06, 0x3E, 0x66, 0x3E, 0x00}, {0x60, 0x60, 0x7C, 0x66, 0x66, 0x66, 0x7C, 0x00}, {0x00, 0x00, 0x3C, 0x60, 0x60, 0x60, 0x3C, 0x00}, {0x06, 0x06, 0x3E, 0x66, 0x66, 0x66, 0x3E, 0x00}, {0x00, 0x00, 0x3C, 0x66, 0x7E, 0x60, 0x3C, 0x00}, {0x1C, 0x30, 0x7C, 0x30, 0x30, 0x30, 0x30, 0x00}, {0x00, 0x00, 0x3E, 0x66, 0x66, 0x3E, 0x06, 0x3C}, {0x60, 0x60, 0x7C, 0x66, 0x66, 0x66, 0x66, 0x00}, {0x18, 0x00, 0x38, 0x18, 0x18, 0x18, 0x3C, 0x00}, {0x06, 0x00, 0x06, 0x06, 0x06, 0x66, 0x3C, 0x00}, {0x60, 0x60, 0x66, 0x6C, 0x78, 0x6C, 0x66, 0x00}, {0x38, 0x18, 0x18, 0x18, 0x18, 0x18, 0x3C, 0x00}, {0x00, 0x00, 0x6C, 0x7E, 0x66, 0x66, 0x66, 0x00}, {0x00, 0x00, 0x7C, 0x66, 0x66, 0x66, 0x66, 0x00}, {0x00, 0x00, 0x3C, 0x66, 0x66, 0x66, 0x3C, 0x00}, {0x00, 0x00, 0x7C, 0x66, 0x66, 0x7C, 0x60, 0x60}, {0x00, 0x00, 0x3E, 0x66, 0x66, 0x3E, 0x06, 0x06}, {0x00, 0x00, 0x7C, 0x66, 0x60, 0x60, 0x60, 0x00}, {0x00, 0x00, 0x3C, 0x60, 0x3C, 0x06, 0x3C, 0x00}, {0x30, 0x30, 0x7C, 0x30, 0x30, 0x30, 0x1C, 0x00}, {0x00, 0x00, 0x66, 0x66, 0x66, 0x66, 0x3E, 0x00}, {0x00, 0x00, 0x66, 0x66, 0x66, 0x3C, 0x18, 0x00}, {0x00, 0x00, 0x63, 0x6B, 0x7F, 0x77, 0x63, 0x00}, {0x00, 0x00, 0x66, 0x3C, 0x18, 0x3C, 0x66, 0x00}, {0x00, 0x00, 0x66, 0x66, 0x66, 0x3E, 0x06, 0x3C}, {0x00, 0x00, 0x7E, 0x0C, 0x18, 0x30, 0x7E, 0x00}, {0x0E, 0x18, 0x18, 0x70, 0x18, 0x18, 0x0E, 0x00}, {0x18, 0x18, 0x18, 0x00, 0x18, 0x18, 0x18, 0x00}, {0x70, 0x18, 0x18, 0x0E, 0x18, 0x18, 0x70, 0x00}, {0x3A, 0x6E, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}};

// 只重寫帶有點陣字模的像素點，完美保留 PSRAM 原圖背景背景
void draw_string_8x8_transparent_fast(uint16_t *frame_buffer, int x, int y, const char *str, uint16_t color)
{
    int cursor_x = x;
    while (*str)
    {
        char c = *str++;
        if (c < 32 || c > 126)
            continue;
        int font_idx = c - 32;

        if (cursor_x + 8 > LCD_WIDTH)
            break;

        uint16_t *char_base_ptr = frame_buffer + (y * LCD_WIDTH) + cursor_x;

        for (int i = 0; i < 8; i++)
        {
            if (y + i < 0 || y + i >= LCD_HEIGHT)
                continue;
            uint8_t line_data = font8x8[font_idx][i];
            uint16_t *pixel_ptr = char_base_ptr + (i * LCD_WIDTH);

