NNdroid/esp32s3-remote-display/main/main.c
            if (line_data & 0x80)
                pixel_ptr[0] = color;
            if (line_data & 0x40)
                pixel_ptr[1] = color;
            if (line_data & 0x20)
                pixel_ptr[2] = color;
            if (line_data & 0x10)
                pixel_ptr[3] = color;
            if (line_data & 0x08)
                pixel_ptr[4] = color;
            if (line_data & 0x04)
                pixel_ptr[5] = color;
            if (line_data & 0x02)
                pixel_ptr[6] = color;
            if (line_data & 0x01)
                pixel_ptr[7] = color;
        }
        cursor_x += 8;
    }
}

static void draw_provisioning_screen(esp_lcd_panel_handle_t panel, uint16_t *full_frame)
{
    for (int i = 0; i < LCD_PIXELS; i++)
        full_frame[i] = 0x0000;

    // Outer Neon Border (Cyan 0x07FF)
    for (int x = 4; x < LCD_WIDTH - 4; x++)
    {
        full_frame[4 * LCD_WIDTH + x] = 0x07FF;
        full_frame[(LCD_HEIGHT - 5) * LCD_WIDTH + x] = 0x07FF;
    }
    for (int y = 4; y < LCD_HEIGHT - 4; y++)
    {
        full_frame[y * LCD_WIDTH + 4] = 0x07FF;
        full_frame[y * LCD_WIDTH + (LCD_WIDTH - 5)] = 0x07FF;
    }

    static int anim_step = 0;
    anim_step = (anim_step + 1) % 4;
    const char *spinners[] = {"|", "/", "-", "\\"};

    char title_str[64];
    snprintf(title_str, sizeof(title_str), "== BLE PROVISIONING %s ==", spinners[anim_step]);
    draw_string_8x8_transparent_fast(full_frame, 50, 16, title_str, 0x07FF);

    time_t now_time;
    struct tm timeinfo;
    time(&now_time);
    localtime_r(&now_time, &timeinfo);
    char time_str[32];
    strftime(time_str, sizeof(time_str), "TIME: %Y-%m-%d %H:%M:%S", &timeinfo);
    draw_string_8x8_transparent_fast(full_frame, 20, 35, time_str, 0xFFE0);

    char pop_str[32];
    snprintf(pop_str, sizeof(pop_str), "PoP Key : %s", g_prov_pop);
    char uuid_val_str[64];
    snprintf(uuid_val_str, sizeof(uuid_val_str), "%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%02X",
             g_prov_uuid[0], g_prov_uuid[1], g_prov_uuid[2], g_prov_uuid[3],
             g_prov_uuid[4], g_prov_uuid[5], g_prov_uuid[6], g_prov_uuid[7],
             g_prov_uuid[8], g_prov_uuid[9], g_prov_uuid[10], g_prov_uuid[11],
             g_prov_uuid[12], g_prov_uuid[13], g_prov_uuid[14], g_prov_uuid[15]);

    draw_string_8x8_transparent_fast(full_frame, 20, 60, "Waiting for BLE Provisioning...", 0xFFFF);
    draw_string_8x8_transparent_fast(full_frame, 20, 90, "Device Name : PROV_DISPLAY", 0xE007);
    draw_string_8x8_transparent_fast(full_frame, 20, 110, pop_str, 0xE007);
    draw_string_8x8_transparent_fast(full_frame, 20, 140, "Service UUID:", 0xE007);
    draw_string_8x8_transparent_fast(full_frame, 20, 160, uuid_val_str, 0xE007);
    esp_lcd_panel_draw_bitmap(panel, 0, 0, LCD_WIDTH, LCD_HEIGHT, full_frame);
}



static void wake_up_display(void)
{
    g_idle_seconds = 0;
    if (g_is_sleeping)
    {
        g_is_sleeping = false;
        uint32_t duty = (g_current_brightness * 255) / 100;
        ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, duty);
        ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
        ESP_LOGI("POWER", "Display WOKEN UP!");
    }
}

static void play_audio_tone(int tone_type)
{
    if (!g_audio_enable) return;

    int sample_rate = 44100;
    int duration_ms = (tone_type == 0) ? 250 : 800;
    int freq = (tone_type == 0) ? 1200 : 1750;

    int total_samples = (sample_rate * duration_ms) / 1000;
    int16_t *pcm_buf = (int16_t *)malloc(total_samples * 2 * sizeof(int16_t));
    if (!pcm_buf) return;

    for (int i = 0; i < total_samples; i++)
    {
        double t = (double)i / sample_rate;
        int16_t val = (int16_t)(sin(2.0 * 3.1415926535 * freq * t) * 8000);
        pcm_buf[i * 2] = val;
        pcm_buf[i * 2 + 1] = val;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    size_t bytes_written = 0;
    i2s_channel_write(tx_chan, pcm_buf, total_samples * 2 * sizeof(int16_t), &bytes_written, pdMS_TO_TICKS(1000));
#else
    size_t bytes_written = 0;
    i2s_write(I2S_NUM_0, pcm_buf, total_samples * 2 * sizeof(int16_t), &bytes_written, pdMS_TO_TICKS(1000));
#endif
    free(pcm_buf);
}

static void draw_cyberpunk_clock_screen(esp_lcd_panel_handle_t panel, uint16_t *full_frame)
{
    for (int i = 0; i < LCD_PIXELS; i++)
    {
        full_frame[i] = 0x0821; // Dark Cyber Navy
    }

    // Outer Neon Border Frame (Cyan 0x07FF & Magenta 0xE007)
    for (int x = 4; x < LCD_WIDTH - 4; x++)
    {
        full_frame[4 * LCD_WIDTH + x] = 0x07FF;
        full_frame[5 * LCD_WIDTH + x] = 0x07FF;
        full_frame[(LCD_HEIGHT - 5) * LCD_WIDTH + x] = 0xE007;
        full_frame[(LCD_HEIGHT - 6) * LCD_WIDTH + x] = 0xE007;
    }
    for (int y = 4; y < LCD_HEIGHT - 4; y++)
    {
        full_frame[y * LCD_WIDTH + 4] = 0x07FF;
        full_frame[y * LCD_WIDTH + 5] = 0x07FF;
        full_frame[y * LCD_WIDTH + (LCD_WIDTH - 5)] = 0xE007;
        full_frame[y * LCD_WIDTH + (LCD_WIDTH - 6)] = 0xE007;
    }

    draw_string_8x8_transparent_fast(full_frame, 60, 16, "== CYBERPUNK CLOCK ==", 0x07FF);

    time_t now_time;
    struct tm timeinfo;
    time(&now_time);
    localtime_r(&now_time, &timeinfo);
    char time_buf[16], date_buf[16];
    strftime(time_buf, sizeof(time_buf), "%H:%M:%S", &timeinfo);
    strftime(date_buf, sizeof(date_buf), "%Y-%m-%d", &timeinfo);

    int scale = 3;
    int text_w = 8 * 8 * scale;
    int start_x = (LCD_WIDTH - text_w) / 2;
    int start_y = 55;
    int cur_x = start_x;
    for (int i = 0; time_buf[i] != '\0'; i++)
    {
        char c = time_buf[i];
        if (c >= 32 && c <= 126)
        {
            int font_idx = c - 32;
            for (int row = 0; row < 8; row++)
            {
                uint8_t pixel_row = font8x8[font_idx][row];
                for (int col = 0; col < 8; col++)
                {
                    if (pixel_row & (1 << (7 - col)))
                    {
                        for (int dy = 0; dy < scale; dy++)
                        {
                            for (int dx = 0; dx < scale; dx++)
                            {
                                int px = cur_x + col * scale + dx;
                                int py = start_y + row * scale + dy;
                                if (px < LCD_WIDTH && py < LCD_HEIGHT)
                                    full_frame[py * LCD_WIDTH + px] = 0xFFE0; // Bright Yellow
                            }
                        }
                    }
                }
            }
        }
        cur_x += 8 * scale;
    }

    char alarm_info_str[64];
    snprintf(alarm_info_str, sizeof(alarm_info_str), "DATE: %s  CHIME: %s", date_buf, g_hourly_chime_enable ? "ON" : "OFF");
    draw_string_8x8_transparent_fast(full_frame, 20, 115, alarm_info_str, 0x07E0);

    char alarm_setting_str[64];
    snprintf(alarm_setting_str, sizeof(alarm_setting_str), "ALARM: %02d:%02d [%s]", g_alarm_hour, g_alarm_min, g_alarm_enable ? "ACTIVE" : "OFF");
    draw_string_8x8_transparent_fast(full_frame, 20, 140, alarm_setting_str, g_alarm_enable ? 0xE007 : 0xFFFF);

    char status_str1[64];
    snprintf(status_str1, sizeof(status_str1), "IP: %s  BAT: %d%%", g_device_ip, g_battery_percentage);
    draw_string_8x8_transparent_fast(full_frame, 20, 175, status_str1, 0x07FF);

