NNdroid/esp32s3-remote-display/main/main.c
    esp_lcd_panel_draw_bitmap(panel, 0, 0, LCD_WIDTH, LCD_HEIGHT, full_frame);
}

typedef struct
{
    uint8_t *buf_ptr;
    uint32_t len;
} rx_frame_t;

static QueueHandle_t jpeg_queue = NULL;
static QueueHandle_t free_queue = NULL; // 空闲缓冲区队列
static esp_lcd_panel_handle_t panel_handle = NULL;
static esp_lcd_panel_io_handle_t io_handle = NULL;
static SemaphoreHandle_t s_lcd_trans_done_sem = NULL;

static bool IRAM_ATTR on_lcd_trans_done_callback(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx)
{
    BaseType_t high_task_awoken = pdFALSE;
    if (s_lcd_trans_done_sem)
    {
        xSemaphoreGiveFromISR(s_lcd_trans_done_sem, &high_task_awoken);
    }
    return high_task_awoken == pdTRUE;
}

static uint8_t *rx_frame_buf[RX_BUF_NUM] = {NULL};
static uint8_t *display_buf[DISPLAY_BUF_NUM] = {NULL};
static uint8_t current_buffer_idx = 0;

// ==================== 系统与配网状态机 ====================
static void sys_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    if (event_base == NETWORK_PROV_EVENT)
    {
        switch (event_id)
        {
        case NETWORK_PROV_START:
            g_is_provisioning = true;
            break;
        case NETWORK_PROV_WIFI_CRED_FAIL:
            network_prov_mgr_reset_wifi_sm_state_on_failure();
            break;
        case NETWORK_PROV_END:
            g_is_provisioning = false;
            network_prov_mgr_deinit();
            break;
        default:
            break;
        }
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START)
        esp_wifi_connect();
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE)
    {
        uint16_t ap_count = 0;
        esp_wifi_scan_get_ap_num(&ap_count);
        if (ap_count > 20)
            ap_count = 20; // Limit dynamically if too many
        if (ap_count > 0)
        {
            wifi_ap_record_t *ap_list = (wifi_ap_record_t *)malloc(sizeof(wifi_ap_record_t) * ap_count);
            if (ap_list && esp_wifi_scan_get_ap_records(&ap_count, ap_list) == ESP_OK)
            {
                wifi_config_t wifi_cfg;
                if (esp_wifi_get_config(WIFI_IF_STA, &wifi_cfg) == ESP_OK)
                {
                    wifi_ap_record_t current_ap;
                    if (esp_wifi_sta_get_ap_info(&current_ap) == ESP_OK)
                    {
                        int best_rssi = -127;
                        int best_idx = -1;
                        for (int i = 0; i < ap_count; i++)
                        {
                            if (strcmp((char *)ap_list[i].ssid, (char *)wifi_cfg.sta.ssid) == 0)
                            {
                                if (ap_list[i].rssi > best_rssi)
                                {
                                    best_rssi = ap_list[i].rssi;
                                    best_idx = i;
                                }
                            }
                        }
                        if (best_idx >= 0 && best_rssi > current_ap.rssi + 5)
                        {
                            if (memcmp(ap_list[best_idx].bssid, current_ap.bssid, 6) != 0)
                            {
                                ESP_LOGI("WIFI", "Roaming to stronger AP: %02X:%02X:%02X:%02X:%02X:%02X (RSSI: %d -> %d)",
                                         ap_list[best_idx].bssid[0], ap_list[best_idx].bssid[1], ap_list[best_idx].bssid[2],
                                         ap_list[best_idx].bssid[3], ap_list[best_idx].bssid[4], ap_list[best_idx].bssid[5],
                                         current_ap.rssi, best_rssi);
                                memcpy(wifi_cfg.sta.bssid, ap_list[best_idx].bssid, 6);
                                wifi_cfg.sta.bssid_set = true;
                                esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg);
                                esp_wifi_disconnect();
                            }
                        }
                    }
                }
            }
            if (ap_list)
                free(ap_list);
            else
                esp_wifi_scan_get_ap_records(&ap_count, NULL);
        }
        else
        {
            esp_wifi_scan_get_ap_records(&ap_count, NULL);
        }
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED)
    {
        xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
        if (g_is_provisioning)
            esp_wifi_connect();
        else
        {
            if (s_retry_num < 300)
            {
                s_retry_num++;
                esp_wifi_connect();
            }
            else
            {
                // Do not reset provisioning on router reboot, just restart device to retry
                esp_restart();
            }
        }
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED)
    {
        ESP_LOGI("WIFI", "Connected to AP, triggering IPv6...");
        // 拿到默认 STA 句柄并启动 IPv6 本地链路生成
        esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (netif)
        {
            esp_netif_create_ip6_linklocal(netif);
        }
    }
    else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP)
    {
        wifi_config_t wifi_cfg;
        if (esp_wifi_get_config(WIFI_IF_STA, &wifi_cfg) == ESP_OK)
        {
            if (wifi_cfg.sta.bssid_set)
            {
                wifi_cfg.sta.bssid_set = false;
                esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg);
                ESP_LOGI("WIFI", "Cleared BSSID lock");
            }
        }
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        snprintf(g_device_ip, sizeof(g_device_ip), IPSTR, IP2STR(&event->ip_info.ip));
        s_retry_num = 0;
        xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
    }
    else if (event_base == IP_EVENT && event_id == IP_EVENT_GOT_IP6)
    {
        ip_event_got_ip6_t *event = (ip_event_got_ip6_t *)event_data;
        snprintf(g_device_ip6, sizeof(g_device_ip6), IPV6STR, IPV62STR(event->ip6_info.ip));
        ESP_LOGI("WIFI", "Got IPv6 Address: %s", g_device_ip6);
    }
}

// ==================== NVS 持久化函数 ====================
static void load_settings_from_nvs()
{
    nvs_handle_t my_handle;
    if (nvs_open("storage", NVS_READWRITE, &my_handle) == ESP_OK)
    {
        int32_t saved_br = 60;
        if (nvs_get_i32(my_handle, "brightness", &saved_br) == ESP_OK)
            g_current_brightness = saved_br;

        int32_t saved_vol = 80;
        if (nvs_get_i32(my_handle, "volume", &saved_vol) == ESP_OK)
            g_current_volume = saved_vol;

        int8_t saved_osd = 1;
        if (nvs_get_i8(my_handle, "show_osd", &saved_osd) == ESP_OK)
            g_show_osd = saved_osd;

