NNdroid/esp32s3-remote-display/main/main.c
        int8_t saved_time_osd = 1;
        if (nvs_get_i8(my_handle, "show_time", &saved_time_osd) == ESP_OK)
            g_show_time_osd = saved_time_osd;

        size_t len_tz = sizeof(g_timezone);
        if (nvs_get_str(my_handle, "tz_str", g_timezone, &len_tz) != ESP_OK)
            strcpy(g_timezone, "CST-8");

        size_t len = sizeof(g_admin_user);
        if (nvs_get_str(my_handle, "admin_user", g_admin_user, &len) != ESP_OK)
            strcpy(g_admin_user, "admin");

        len = sizeof(g_admin_pwd);
        if (nvs_get_str(my_handle, "admin_pwd", g_admin_pwd, &len) != ESP_OK)
            strcpy(g_admin_pwd, "123456");

        int32_t saved_port = 8888;
        if (nvs_get_i32(my_handle, "udp_port", &saved_port) == ESP_OK)
            g_udp_port = saved_port;

        size_t len_pop = sizeof(g_prov_pop);
        if (nvs_get_str(my_handle, "prov_pop", g_prov_pop, &len_pop) != ESP_OK)
        {
            snprintf(g_prov_pop, sizeof(g_prov_pop), "%08lu", esp_random() % 100000000);
            nvs_set_str(my_handle, "prov_pop", g_prov_pop);
        }

        size_t len_uuid = sizeof(g_prov_uuid);
        if (nvs_get_blob(my_handle, "prov_uuid", g_prov_uuid, &len_uuid) != ESP_OK)
        {
            esp_fill_random(g_prov_uuid, sizeof(g_prov_uuid));
            g_prov_uuid[6] = (g_prov_uuid[6] & 0x0F) | 0x40;
            g_prov_uuid[8] = (g_prov_uuid[8] & 0x3F) | 0x80;
            nvs_set_blob(my_handle, "prov_uuid", g_prov_uuid, sizeof(g_prov_uuid));
        }

        uint8_t u8_tmp = 0;
        if (nvs_get_u8(my_handle, "rgb_r", &u8_tmp) == ESP_OK)
            g_rgb_r = u8_tmp;
        if (nvs_get_u8(my_handle, "rgb_g", &u8_tmp) == ESP_OK)
            g_rgb_g = u8_tmp;
        if (nvs_get_u8(my_handle, "rgb_b", &u8_tmp) == ESP_OK)
            g_rgb_b = u8_tmp;

        int8_t saved_audio = 1;
        if (nvs_get_i8(my_handle, "audio_enable", &saved_audio) == ESP_OK)
            g_audio_enable = saved_audio;

        int8_t saved_mx = 0;
        if (nvs_get_i8(my_handle, "mirror_x", &saved_mx) == ESP_OK)
            g_mirror_x = saved_mx;

        int8_t saved_my = 0;
        if (nvs_get_i8(my_handle, "mirror_y", &saved_my) == ESP_OK)
            g_mirror_y = saved_my;

        int8_t saved_chime = 1;
        if (nvs_get_i8(my_handle, "hourly_chime", &saved_chime) == ESP_OK)
            g_hourly_chime_enable = saved_chime;

        int8_t saved_alarm = 0;
        if (nvs_get_i8(my_handle, "alarm_enable", &saved_alarm) == ESP_OK)
            g_alarm_enable = saved_alarm;

        int8_t saved_ah = 8;
        if (nvs_get_i8(my_handle, "alarm_h", &saved_ah) == ESP_OK)
            g_alarm_hour = saved_ah;

        int8_t saved_am = 0;
        if (nvs_get_i8(my_handle, "alarm_m", &saved_am) == ESP_OK)
            g_alarm_min = saved_am;

        nvs_commit(my_handle);
        nvs_close(my_handle);
    }
}

static void save_int_to_nvs(const char *key, int32_t val)
{
    nvs_handle_t my_handle;
    if (nvs_open("storage", NVS_READWRITE, &my_handle) == ESP_OK)
    {
        nvs_set_i32(my_handle, key, val);
        nvs_commit(my_handle);
        nvs_close(my_handle);
    }
}
static void save_i8_to_nvs(const char *key, int8_t val)
{
    nvs_handle_t my_handle;
    if (nvs_open("storage", NVS_READWRITE, &my_handle) == ESP_OK)
    {
        nvs_set_i8(my_handle, key, val);
        nvs_commit(my_handle);
        nvs_close(my_handle);
    }
}
static void save_str_to_nvs(const char *key, const char *val)
{
    nvs_handle_t my_handle;
    if (nvs_open("storage", NVS_READWRITE, &my_handle) == ESP_OK)
    {
        nvs_set_str(my_handle, key, val);
        nvs_commit(my_handle);
        nvs_close(my_handle);
    }
}
static void save_u8_to_nvs(const char *key, uint8_t val)
{
    nvs_handle_t my_handle;
    if (nvs_open("storage", NVS_READWRITE, &my_handle) == ESP_OK)
    {
        nvs_set_u8(my_handle, key, val);
        nvs_commit(my_handle);
        nvs_close(my_handle);
    }
}

// ==================== 硬件初始化 ====================
static void lcd_hardware_init(void)
{
    spi_bus_config_t buscfg = {
        .sclk_io_num = TFT_SCK,
        .mosi_io_num = TFT_MOSI,
        .miso_io_num = TFT_MISO,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = (LCD_PIXELS * 2) + 8};
    ESP_ERROR_CHECK(spi_bus_initialize(LCD_HOST, &buscfg, SPI_DMA_CH_AUTO));
    gpio_set_drive_capability(TFT_SCK, GPIO_DRIVE_CAP_3);
    gpio_set_drive_capability(TFT_MOSI, GPIO_DRIVE_CAP_3);
    gpio_set_drive_capability(TFT_CS, GPIO_DRIVE_CAP_3);
    gpio_set_drive_capability(TFT_DC, GPIO_DRIVE_CAP_3);

    esp_lcd_panel_io_spi_config_t io_config = {.dc_gpio_num = TFT_DC, .cs_gpio_num = TFT_CS, .pclk_hz = 40 * 1000 * 1000, .lcd_cmd_bits = 8, .lcd_param_bits = 8, .spi_mode = 0, .trans_queue_depth = 20};
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST, &io_config, &io_handle));

    s_lcd_trans_done_sem = xSemaphoreCreateBinary();
    if (s_lcd_trans_done_sem)
    {
        xSemaphoreGive(s_lcd_trans_done_sem);
    }
    esp_lcd_panel_io_callbacks_t cbs = {
        .on_color_trans_done = on_lcd_trans_done_callback,
    };
    esp_lcd_panel_io_register_event_callbacks(io_handle, &cbs, NULL);
    esp_lcd_panel_dev_config_t panel_config = {.reset_gpio_num = TFT_RST, .bits_per_pixel = 16};
    ESP_ERROR_CHECK(esp_lcd_new_panel_ili9341(io_handle, &panel_config, &panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
    vTaskDelay(pdMS_TO_TICKS(120));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    load_settings_from_nvs();
    uint32_t init_duty = (g_current_brightness * 255) / 100;
    ledc_timer_config_t ledc_timer = {.speed_mode = LEDC_LOW_SPEED_MODE, .duty_resolution = LEDC_TIMER_8_BIT, .timer_num = LEDC_TIMER_0, .freq_hz = 5000, .clk_cfg = LEDC_AUTO_CLK};
    ledc_timer_config(&ledc_timer);
    ledc_channel_config_t ledc_channel = {.speed_mode = LEDC_LOW_SPEED_MODE, .channel = LEDC_CHANNEL_0, .timer_sel = LEDC_TIMER_0, .intr_type = LEDC_INTR_DISABLE, .gpio_num = TFT_BL, .duty = init_duty, .hpoint = 0};
    ledc_channel_config(&ledc_channel);

    ESP_ERROR_CHECK(esp_lcd_panel_swap_xy(panel_handle, true));
    uint8_t madctl_val = 0x28; // Standard landscape BGR
    esp_lcd_panel_io_tx_param(io_handle, 0x36, &madctl_val, 1);
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle, true));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));
}

static void sd_card_init(void)
{
    // If already mounted, check if it's still accessible.
    if (g_sd_card_mounted)
    {
        uint64_t total, free;
        if (esp_vfs_fat_info(MOUNT_POINT, &total, &free) == ESP_OK)
        {
            return; // Still OK, do nothing.
        }
        else
        {
            ESP_LOGW("SD", "Card was mounted but is now inaccessible. Unmounting.");
            esp_vfs_fat_sdcard_unmount(MOUNT_POINT, s_card);
            g_sd_card_mounted = false;
        }
    }

    esp_err_t ret;
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = true,
        .max_files = 5,
        .allocation_unit_size = 16 * 1024};

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.max_freq_khz = SDMMC_FREQ_DEFAULT;

