NNdroid/esp32s3-remote-display/main/main.c
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 4; // 4-line mode
    slot_config.clk = SD_PIN_CLK;
    slot_config.cmd = SD_PIN_CMD;
    slot_config.d0 = SD_PIN_D0;
    slot_config.d1 = SD_PIN_D1;
    slot_config.d2 = SD_PIN_D2;
    slot_config.d3 = SD_PIN_D3;

    ret = esp_vfs_fat_sdmmc_mount(MOUNT_POINT, &host, &slot_config, &mount_config, &s_card);

    if (ret != ESP_OK)
    {
        // Don't log error if it's just not found, that's expected on boot without card.
        if (ret != ESP_ERR_NOT_FOUND)
        {
            ESP_LOGE("SD", "Failed to mount SD card (%s).", esp_err_to_name(ret));
        }
        g_sd_card_mounted = false;
    }
    else
    {
        ESP_LOGI("SD", "SD card mounted at %s", MOUNT_POINT);
        sdmmc_card_print_info(stdout, s_card);
        g_sd_card_mounted = true;
    }
}

static void rgb_led_init(void)
{
    led_strip_config_t strip_config = {
        .strip_gpio_num = RGB_LED_PIN,
        .max_leds = 1, // 这里假定只有一颗灯珠，如有多颗可自行修改
    };
    led_strip_rmt_config_t rmt_config = {
        .resolution_hz = 10 * 1000 * 1000, // 10MHz
    };
    if (led_strip_new_rmt_device(&strip_config, &rmt_config, &s_led_strip) == ESP_OK)
    {
        led_strip_set_pixel(s_led_strip, 0, g_rgb_r, g_rgb_g, g_rgb_b);
        led_strip_refresh(s_led_strip);
    }
}

static esp_err_t es8311_write_reg(uint8_t reg, uint8_t val)
{
    if (!es8311_dev_handle)
        return ESP_FAIL;
    uint8_t data[2] = {reg, val};
    esp_err_t err = i2c_master_transmit(es8311_dev_handle, data, sizeof(data), pdMS_TO_TICKS(100));
    if (err != ESP_OK)
    {
        ESP_LOGE("ES8311", "I2C Write Failed! Reg: 0x%02X, Err: %s", reg, esp_err_to_name(err));
    }
    return err;
}

static void es8311_codec_init(void)
{
    i2c_master_bus_config_t i2c_bus_cfg = {
        .i2c_port = I2C_NUM_0,
        .sda_io_num = I2C_SDA_PIN,
        .scl_io_num = I2C_SCL_PIN,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus_handle;
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &bus_handle));

    i2c_device_config_t i2c_dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = 0x18,
        .scl_speed_hz = 400000,
    };
    ESP_ERROR_CHECK(i2c_master_bus_add_device(bus_handle, &i2c_dev_cfg, &es8311_dev_handle));

    // ES8311 寄存器初始化序列 (44.1kHz, 16bit, Slave 接收模式)
    // 完全复刻官方库 es8311_init 与 es8311_sample_frequency_config 逻辑
    es8311_write_reg(0x00, 0x1F);
    vTaskDelay(pdMS_TO_TICKS(30)); // Reset
    es8311_write_reg(0x00, 0x00);
    es8311_write_reg(0x00, 0x80); // Power-on command (CSM=1)

    es8311_write_reg(0x01, 0x3F); // Clock config: Enable all clocks
    es8311_write_reg(0x02, 0x00); // MCLK pre-div=1, pre-multi=1x
    es8311_write_reg(0x03, 0x10); // fs_mode=ss, adc_osr=16
    es8311_write_reg(0x04, 0x10); // dac_osr=16
    es8311_write_reg(0x05, 0x00); // adc_div=1, dac_div=1
    es8311_write_reg(0x06, 0x03); // bclk_div=4
    es8311_write_reg(0x07, 0x00); // lrck_h=0
    es8311_write_reg(0x08, 0xFF); // lrck_l=255

    es8311_write_reg(0x09, 0x0C); // SDP IN: 16-bit
    es8311_write_reg(0x0A, 0x0C); // SDP OUT: 16-bit

    es8311_write_reg(0x0D, 0x01); // Power up analog circuitry
    es8311_write_reg(0x0E, 0x02); // Enable analog PGA, enable ADC modulator
    es8311_write_reg(0x12, 0x00); // Power-up DAC
    es8311_write_reg(0x13, 0x10); // Enable output to HP drive (Crucial!)
    es8311_write_reg(0x1C, 0x6A); // ADC Equalizer bypass
    es8311_write_reg(0x37, 0x08); // Bypass DAC equalizer

    es8311_write_reg(0x31, 0x00); // DAC unmute

    es8311_write_reg(0x32, 0); // Set initial volume to 0 to prevent pop
}

static void audio_hardware_init(void)
{
    // PA 使能引脚初始化 (低电平使能)
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << PA_EN_PIN),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = 0,
        .pull_down_en = 0,
        .intr_type = GPIO_INTR_DISABLE};
    gpio_config(&io_conf);
    gpio_set_level(PA_EN_PIN, 1); // Keep PA disabled initially to prevent pop

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
    ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg, &tx_chan, NULL));

    i2s_std_config_t std_cfg = {
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(44100),
        .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO),
        .gpio_cfg = {
            .mclk = I2S_MCLK_PIN,
            .bclk = I2S_BCLK_PIN,
            .ws = I2S_LRCK_PIN,
            .dout = I2S_DOUT_PIN,
            .din = I2S_DIN_PIN,
            .invert_flags = {
                .mclk_inv = false,
                .bclk_inv = false,
                .ws_inv = false,
            },
        },
    };
    ESP_ERROR_CHECK(i2s_channel_init_std_mode(tx_chan, &std_cfg));
    ESP_ERROR_CHECK(i2s_channel_enable(tx_chan));
#else
    i2s_config_t i2s_config = {
        .mode = I2S_MODE_MASTER | I2S_MODE_TX,
        .sample_rate = 44100,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 6,
        .dma_buf_len = 512,
        .use_apll = false, // ESP32-S3 硬件不支持 APLL，使用默认时钟即可
        .tx_desc_auto_clear = true};
    i2s_pin_config_t pin_config = {
        .mck_io_num = I2S_MCLK_PIN,
        .bck_io_num = I2S_BCLK_PIN,
        .ws_io_num = I2S_LRCK_PIN,
        .data_out_num = I2S_DOUT_PIN,
        .data_in_num = I2S_DIN_PIN};
    ESP_ERROR_CHECK(i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL));
    ESP_ERROR_CHECK(i2s_set_pin(I2S_NUM_0, &pin_config));
    ESP_ERROR_CHECK(i2s_zero_dma_buffer(I2S_NUM_0));
#endif

    // 必须在 I2S 时钟 (MCLK) 启动后，再初始化 ES8311，否则它可能无法响应配置
    es8311_codec_init();

    // After codec is configured and stable, enable the PA and ramp up volume
    if (g_audio_enable)
    {
        gpio_set_level(PA_EN_PIN, 0); // Enable PA (low level)
        ESP_LOGI("AUDIO", "Ramping up volume for soft start...");
        for (int i = 0; i <= g_current_volume; i++)
        {
            uint8_t vol_reg = i == 0 ? 0 : ((i * 256 / 100) - 1);
            es8311_write_reg(0x32, vol_reg);
            vTaskDelay(pdMS_TO_TICKS(3)); // 3ms per step for a smoother fade-in
        }
        ESP_LOGI("AUDIO", "Volume ramp-up complete.");
    }
}

static void battery_adc_init(void)
{
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &adc1_handle));

    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = MY_ADC_ATTEN,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_8, &config)); // IO9 是 ESP32-S3 的 ADC1_CH8

    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .chan = ADC_CHANNEL_8,
        .atten = MY_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if (adc_cali_create_scheme_curve_fitting(&cali_config, &adc1_cali_handle) == ESP_OK)
    {
        do_calibration = true;
    }
}

void audio_receiver_task(void *pvParameters)
{
    int rcv_buf_size = 65536; // 增大 Socket 缓冲区，应对突发数据
    // 将超时时间从 1 秒大幅缩短至 100 毫秒，以便快速响应网络丢包
    struct timeval timeout = {.tv_sec = 0, .tv_usec = 100000};
    uint8_t *read_buf = (uint8_t *)malloc(4096);
    // 创建一个用于“补帧”的静音包
    uint8_t *silence_buf = (uint8_t *)calloc(1, 3528); // 44.1kHz 16bit 立体声 20ms 的数据量

    if (!read_buf || !silence_buf)
    {
        ESP_LOGE("AUDIO", "Failed to allocate audio buffers");
        if (read_buf)
            free(read_buf);
        if (silence_buf)
            free(silence_buf);
        vTaskDelete(NULL);
    }
    static bool first_audio = true;

    while (1)
    {
        if (g_is_playing_from_sd)
        {
            // 如果正在播放 SD 卡，暂停网络音频接收，让出 I2S 资源
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

