NNdroid/esp32s3-remote-display/main/main.c
        xEventGroupWaitBits(s_wifi_event_group, WIFI_CONNECTED_BIT, pdFALSE, pdTRUE, portMAX_DELAY);
        int sock = socket(AF_INET6, SOCK_DGRAM, IPPROTO_IP);
        if (sock < 0)
        {
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }

        int v6only = 0;
        setsockopt(sock, IPPROTO_IPV6, IPV6_V6ONLY, &v6only, sizeof(v6only));
        setsockopt(sock, SOL_SOCKET, SO_RCVBUF, &rcv_buf_size, sizeof(rcv_buf_size));
        setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

        struct sockaddr_in6 dest_addr = {0};
        dest_addr.sin6_family = AF_INET6;
        dest_addr.sin6_port = htons(g_udp_port + 1); // 独立接收音频端口 (视频端口 + 1)
        dest_addr.sin6_addr = in6addr_any;

        if (bind(sock, (struct sockaddr *)&dest_addr, sizeof(dest_addr)) < 0)
        {
            close(sock);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        while (1)
        {
            // 修复：同时监听 SD 卡播放状态，一旦开始播放立刻跳出内层循环，关闭 Socket 并释放资源
            if ((xEventGroupGetBits(s_wifi_event_group) & WIFI_CONNECTED_BIT) == 0 || g_is_playing_from_sd)
                break;
            int len = recvfrom(sock, read_buf, 4096, 0, NULL, NULL);

            if (len > 0)
            {
                if (first_audio)
                {
                    ESP_LOGW("AUDIO", "✅ First audio packet received! Length: %d bytes", len);
                    first_audio = false; // 打印日志以确认网络包已成功到达音频端口
                }
                if (g_audio_enable)
                {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
                    size_t bytes_written = 0;
                    // 使用有限超时，避免音频任务被 I2S 长时间阻塞
                    i2s_channel_write(tx_chan, read_buf, len, &bytes_written, pdMS_TO_TICKS(100));
#else
                    size_t bytes_written = 0;
                    i2s_write(I2S_NUM_0, read_buf, len, &bytes_written, pdMS_TO_TICKS(100));
#endif
                }
            }
            else if (errno == EAGAIN || errno == EWOULDBLOCK)
            {
                g_audio_plc_count++; // 累加丢包补偿计数
                // 超时，说明网络发生抖动或丢包，主动写入 20ms 静音数据来填充 I2S 硬件缓冲
                // 避免 DMA 缓冲“饿死”产生爆音，实现“丢包不掉线”的平滑过渡
                if (g_audio_enable && !first_audio)
                {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
                    size_t bytes_written = 0;
                    i2s_channel_write(tx_chan, silence_buf, 3528, &bytes_written, pdMS_TO_TICKS(100));
#else
                    size_t bytes_written = 0;
                    i2s_write(I2S_NUM_0, silence_buf, 3528, &bytes_written, pdMS_TO_TICKS(100));
#endif
                }
            }
            else
            {
                // 发生其他 Socket 错误
                ESP_LOGE("AUDIO", "Socket recv error: %d", errno);
                break; // 跳出内层循环，重新建立 Socket
            }
        }
        close(sock);
        first_audio = true; // 重置标志位
        vTaskDelay(pdMS_TO_TICKS(500)); // 避免错误发生后疯狂重连
    }
}

void jpeg_decode_display_task(void *pvParameters)
{
    esp_task_wdt_add(NULL);
    int fps_counter = 0;
    int current_fps = 0;
    int8_t current_rssi = 0;
    int screen_state = 0;
    TickType_t last_frame_time = xTaskGetTickCount(), last_fps_time = xTaskGetTickCount();
    static int last_screen_state = -1;

    // 16行 MCU 行解碼流水線。一步到位直接硬转换输出 RGB565_BE
    jpeg_dec_config_t config = {
        .output_type = JPEG_PIXEL_FORMAT_RGB565_BE,
        .scale = {.width = 0, .height = 0},
        .clipper = {.width = 0, .height = 0},
        .rotate = JPEG_ROTATE_0D,
        .block_enable = true};

    while (1)
    {
        esp_task_wdt_reset();
        rx_frame_t current_frame;
        if (xQueueReceive(jpeg_queue, &current_frame, pdMS_TO_TICKS(5)) == pdTRUE)
        {
            if (current_frame.len >= 1024)
            {
                wake_up_display();
            }
            jpeg_dec_handle_t jpeg_dec = NULL;
            if (jpeg_dec_open(&config, &jpeg_dec) != JPEG_ERR_OK)
            {
                xQueueSend(free_queue, &current_frame, 0);
                continue;
            }

            jpeg_dec_io_t jpeg_io = {0};
            jpeg_dec_header_info_t out_info = {0};
            jpeg_io.inbuf = current_frame.buf_ptr;
            jpeg_io.inbuf_len = current_frame.len;

            if (jpeg_dec_parse_header(jpeg_dec, &jpeg_io, &out_info) == JPEG_ERR_OK)
            {
                if (out_info.width > LCD_WIDTH || out_info.height > LCD_HEIGHT)
                {
                    ESP_LOGE("JPEG", "Frame too large: %dx%d, dropping!", (int)out_info.width, (int)out_info.height);
                    jpeg_dec_close(jpeg_dec);
                    xQueueSend(free_queue, &current_frame, 0);
                    continue;
                }

                if (s_lcd_trans_done_sem)
                {
                    xSemaphoreTake(s_lcd_trans_done_sem, pdMS_TO_TICKS(50));
                }

                uint16_t *full_frame = (uint16_t *)display_buf[current_buffer_idx];

                // 16行 16行 地跑，完全规避 PSRAM 慢速，彻底消灭 Cache Miss！
                int cur_row = 0;
                bool decode_ok = true;
                bool is_first_block = true;
                while (cur_row < out_info.height)
                {
                    jpeg_io.outbuf = (uint8_t *)(full_frame + (cur_row * LCD_WIDTH));

                    if (!is_first_block)
                    {
                        int inbuf_consumed = jpeg_io.inbuf_len - jpeg_io.inbuf_remain;
                        jpeg_io.inbuf += inbuf_consumed;
                        jpeg_io.inbuf_len = jpeg_io.inbuf_remain;
                    }
                    is_first_block = false;

                    jpeg_io.out_size = 0;

                    if (jpeg_dec_process(jpeg_dec, &jpeg_io) != JPEG_ERR_OK)
                    {
                        decode_ok = false;
                        break;
                    }

                    if (jpeg_io.out_size == 0 || out_info.width == 0)
                        break;

                    int rows_decoded = jpeg_io.out_size / (out_info.width * 2);
                    if (rows_decoded == 0)
                    {
                        decode_ok = false;
                        break;
                    }

                    cur_row += rows_decoded;
                }

                if (decode_ok)
                {
                    last_frame_time = xTaskGetTickCount();
                    screen_state = 1;
                    // 软件预翻转视频画面 (RAM Pre-flip video buffer using dynamic JPEG width & height)
                    int frame_w = (out_info.width > 0 && out_info.width <= LCD_WIDTH) ? out_info.width : LCD_WIDTH;
                    int frame_h = (out_info.height > 0 && out_info.height <= LCD_HEIGHT) ? out_info.height : LCD_HEIGHT;

                    if (g_mirror_x)
                    {
                        for (int y = 0; y < frame_h; y++)
                        {
                            uint16_t *row = &full_frame[y * LCD_WIDTH];
                            for (int x = 0; x < frame_w / 2; x++)
                            {
                                uint16_t tmp = row[x];
                                row[x] = row[frame_w - 1 - x];
                                row[frame_w - 1 - x] = tmp;
                            }
                        }
                    }
                    if (g_mirror_y)
                    {
                        uint16_t tmp_row[LCD_WIDTH];
                        for (int y = 0; y < frame_h / 2; y++)
                        {
                            uint16_t *row1 = &full_frame[y * LCD_WIDTH];
                            uint16_t *row2 = &full_frame[(frame_h - 1 - y) * LCD_WIDTH];
                            memcpy(tmp_row, row1, frame_w * sizeof(uint16_t));
                            memcpy(row1, row2, frame_w * sizeof(uint16_t));
                            memcpy(row2, tmp_row, frame_w * sizeof(uint16_t));
                        }
                    }

                    fps_counter++;
                    TickType_t now = xTaskGetTickCount();
                    static char cached_osd_str[32] = {0}, cached_time_str[32] = {0}, cached_heap_str[32] = {0}, cached_cpu_str[32] = {0}, cached_net_str[32] = {0}, cached_bssid_str[32] = {0}, cached_sd_str[32] = {0}, cached_bat_str[16] = {0};
                    static int cached_time_width = 0;

                    if (now - last_fps_time >= pdMS_TO_TICKS(1000))
                    {
                        current_fps = fps_counter;
                        fps_counter = 0;
                        last_fps_time = now;
                        g_current_fps = current_fps;

                        uint32_t max_idle_1s_c0 = g_core0_max_idle * 5;
                        uint32_t max_idle_1s_c1 = g_core1_max_idle * 5;

