NNdroid/esp32s3-remote-display/main/main.c
                        uint32_t idle_c0 = g_core0_idle_cnt;
                        g_core0_idle_cnt = 0;
                        uint32_t idle_c1 = g_core1_idle_cnt;
                        g_core1_idle_cnt = 0;

                        int cpu0 = 100 - (idle_c0 * 100 / max_idle_1s_c0);
                        int cpu1 = 100 - (idle_c1 * 100 / max_idle_1s_c1);

                        if (cpu0 < 0)
                        {
                            cpu0 = 0;
                        }
                        if (cpu0 > 100)
                        {
                            cpu0 = 100;
                        }
                        if (cpu1 < 0)
                        {
                            cpu1 = 0;
                        }
                        if (cpu1 > 100)
                        {
                            cpu1 = 100;
                        }
                        g_core0_usage = cpu0;
                        g_core1_usage = cpu1;

                        current_rssi = g_async_wifi_rssi;
                        g_current_rssi = current_rssi;

                        snprintf(cached_cpu_str, sizeof(cached_cpu_str), "C0:%d%% C1:%d%%", cpu0, cpu1);
                        snprintf(cached_osd_str, sizeof(cached_osd_str), "%ddB %dFPS", current_rssi, current_fps);
                        snprintf(cached_heap_str, sizeof(cached_heap_str), "Heap:%luKB", (unsigned long)g_async_free_heap_kb);
                        snprintf(cached_net_str, sizeof(cached_net_str), "DL:%luKB/s", (unsigned long)g_current_rx_speed_kbps);
                        strncpy(cached_bssid_str, (const char *)g_async_wifi_bssid, sizeof(cached_bssid_str) - 1);

                        if (g_sd_card_mounted)
                        {
                            snprintf(cached_sd_str, sizeof(cached_sd_str), "SD:%s", g_is_playing_from_sd ? "PLAY" : "READY");
                        }
                        else
                        {
                            cached_sd_str[0] = '\0';
                        }
                        snprintf(cached_bat_str, sizeof(cached_bat_str), "BAT:%d%%", g_battery_percentage);

                        time_t now_time;
                        struct tm timeinfo;
                        time(&now_time);
                        localtime_r(&now_time, &timeinfo);
                        strftime(cached_time_str, sizeof(cached_time_str), "%Y-%m-%d %H:%M:%S", &timeinfo);
                        cached_time_width = strlen(cached_time_str) * 8;
                        ESP_LOGI("SYS", "Free: %lu, MaxBlock: %lu, StackWaterMark: %d",
                                 esp_get_free_heap_size(),
                                 heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM),
                                 uxTaskGetStackHighWaterMark(NULL));
                    }

                    if (g_show_osd)
                    {
                        if (cached_bat_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 70, cached_bat_str, 0x07E0);
                        }
                        if (cached_sd_str[0] != '\0')
                        {
                            uint16_t sd_color = 0x07E0; // 默认绿色
                            if (g_is_playing_from_sd)
                            {
                                sd_color = ((xTaskGetTickCount() / pdMS_TO_TICKS(500)) % 2 == 0) ? 0x07E0 : 0xFFFF; // 播放时绿白闪烁
                            }
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 60, cached_sd_str, sd_color);
                        }
                        if (cached_bssid_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 50, cached_bssid_str, 0xFFFF);
                        }
                        if (cached_net_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 40, cached_net_str, 0xFFFF);
                        }
                        if (cached_osd_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 30, cached_osd_str, 0xE007);
                        }
                        if (cached_cpu_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 20, cached_cpu_str, 0x07E0);
                        }
                        if (cached_heap_str[0] != '\0')
                        {
                            draw_string_8x8_transparent_fast(full_frame, 2, LCD_HEIGHT - 10, cached_heap_str, 0x07FF);
                        }
                    }

                    if (g_show_time_osd && cached_time_str[0] != '\0')
                    {
                        int x_pos = LCD_WIDTH - cached_time_width - 2;
                        draw_string_8x8_transparent_fast(full_frame, x_pos, 2, cached_time_str, 0xFFFF);
                    }

                    // 检查整点报时与闹钟触发
                    time_t chime_now;
                    struct tm chime_info;
                    time(&chime_now);
                    localtime_r(&chime_now, &chime_info);

                    if (g_hourly_chime_enable && chime_info.tm_min == 0 && chime_info.tm_sec == 0 && chime_info.tm_hour != s_last_chime_hour)
                    {
                        s_last_chime_hour = chime_info.tm_hour;
                        play_audio_tone(0);
                        wake_up_display();
                        s_chime_banner_until = xTaskGetTickCount() + pdMS_TO_TICKS(4000);
                        snprintf(s_chime_banner_str, sizeof(s_chime_banner_str), "🔔 HOURLY CHIME %02d:00", chime_info.tm_hour);
                    }

                    if (g_alarm_enable && chime_info.tm_hour == g_alarm_hour && chime_info.tm_min == g_alarm_min && chime_info.tm_min != s_last_alarm_min && chime_info.tm_sec == 0)
                    {
                        s_last_alarm_min = chime_info.tm_min;
                        play_audio_tone(1);
                        wake_up_display();
                        s_chime_banner_until = xTaskGetTickCount() + pdMS_TO_TICKS(6000);
                        snprintf(s_chime_banner_str, sizeof(s_chime_banner_str), "⏰ ALARM RINGING %02d:%02d", chime_info.tm_hour, chime_info.tm_min);
                    }

