NNdroid/esp32s3-remote-display/main/main.c
                    if (xTaskGetTickCount() < s_chime_banner_until && s_chime_banner_str[0] != '\0')
                    {
                        draw_string_8x8_transparent_fast(full_frame, 30, 10, s_chime_banner_str, 0xFFE0);
                    }

                    // 将拼装好的成品一次性抛给底层 DMA 推送到 ILI9341
                    esp_lcd_panel_draw_bitmap(panel_handle, 0, 0, LCD_WIDTH, LCD_HEIGHT, full_frame);

                    current_buffer_idx = (current_buffer_idx + 1) % DISPLAY_BUF_NUM;
                    last_screen_state = 1;
                }
            }
            jpeg_dec_close(jpeg_dec);
            xQueueSend(free_queue, &current_frame, 0);
        }
        else
        {
            if (screen_state == 1 && xTaskGetTickCount() - last_frame_time > pdMS_TO_TICKS(3000))
                screen_state = 0;
            vTaskDelay(pdMS_TO_TICKS(200));
        }

        if (screen_state == 0)
        {
            if (g_auto_sleep_enable)
            {
                static int sub_second_counter = 0;
                sub_second_counter++;
                if (sub_second_counter >= 5) // 5 * 200ms = 1秒，使 g_idle_seconds 准确按秒累加
                {
                    sub_second_counter = 0;
                    g_idle_seconds++;
                }

                if (g_idle_seconds >= 180 && !g_is_sleeping)
                {
                    g_is_sleeping = true;
                    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, 0);
                    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
                    ESP_LOGI("POWER", "Display Auto SLEEP (3 min idle)");
                }
            }

            if (!g_is_sleeping)
            {
                time_t now_sec;
                time(&now_sec);
                static time_t last_clock_draw_sec = 0;

                // 仅在秒数改变或刚从视频切回待机时，才精准重绘 1 帧时钟，彻底消除高频 Wipe 导致的画面撕裂一闪一闪
                if (now_sec != last_clock_draw_sec || last_screen_state != 0)
                {
                    last_clock_draw_sec = now_sec;
                    if (s_lcd_trans_done_sem)
                    {
                        xSemaphoreTake(s_lcd_trans_done_sem, pdMS_TO_TICKS(50));
                    }
                    if (g_is_provisioning)
                        draw_provisioning_screen(panel_handle, (uint16_t *)display_buf[current_buffer_idx]);
                    else
                        draw_cyberpunk_clock_screen(panel_handle, (uint16_t *)display_buf[current_buffer_idx]);
                    current_buffer_idx = (current_buffer_idx + 1) % DISPLAY_BUF_NUM;
                }
            }
            last_screen_state = 0;
        }
    }
}

void sd_playback_task(void *pvParameters)
{
    uint8_t *file_read_buf = (uint8_t *)malloc(188 * 256); // 48KB large buffer for 4x SD FATFS read speed
    if (!file_read_buf)
    {
        ESP_LOGE("PLAY", "Failed to allocate file read buffer!");
        vTaskDelete(NULL);
    }

    rx_frame_t current_rx_frame;
    bool has_active_buffer = false;
    uint32_t current_frame_len = 0;
    bool frame_corrupted = true;
    int8_t last_video_cc = -1;
    uint16_t video_pid = 0x2000;
    int8_t last_audio_cc = -1;
    uint16_t audio_pid = 0x2000;

    while (1)
    {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY); // Wait for a play command

        g_is_playing_from_sd = true;
        g_stop_playback = false;
        g_pause_playback = false;
        g_seek_permille = -1;
        video_pid = 0x2000;
        audio_pid = 0x2000;
        frame_corrupted = true;
        has_active_buffer = false;

        char filepath[200];
        snprintf(filepath, sizeof(filepath), "%s/%s", MOUNT_POINT, s_playback_filename);

        FILE *f = fopen(filepath, "r");
        if (!f)
        {
            ESP_LOGE("PLAY", "Failed to open %s", filepath);
            g_is_playing_from_sd = false;
            continue;
        }

        fseek(f, 0, SEEK_END);
        g_sd_file_size = ftell(f);
        fseek(f, 0, SEEK_SET);
        g_sd_current_pos = 0;

        ESP_LOGI("PLAY", "Playing %s...", filepath);

        while (!g_stop_playback)
        {
            if (g_seek_permille >= 0)
            {
                uint32_t target_pos = (g_sd_file_size / 1000) * g_seek_permille;
                target_pos = (target_pos / 188) * 188; // 强制 188 字节对齐，完美匹配 TS 格式包头
                fseek(f, target_pos, SEEK_SET);
                g_seek_permille = -1;
                g_sd_current_pos = ftell(f);
                frame_corrupted = true;
                has_active_buffer = false;
            }

            if (g_pause_playback)
            {
                vTaskDelay(pdMS_TO_TICKS(50));
                continue;
            }

            size_t bytes_read = fread(file_read_buf, 1, 188 * 256, f);
            if (bytes_read == 0)
                break; // End of file

            g_sd_current_pos = ftell(f);

            for (int offset = 0; offset <= (int)bytes_read - 188; offset += 188)
            {
                if (g_stop_playback)
                    break;

                uint8_t *ts = &file_read_buf[offset];
                if (ts[0] != 0x47)
                    continue;

                uint16_t pid = ((ts[1] & 0x1F) << 8) | ts[2];
                uint8_t pusi = (ts[1] & 0x40) >> 6;
                uint8_t afc = (ts[3] & 0x30) >> 4;
                uint8_t cc = ts[3] & 0x0F;

                if (afc == 0 || afc == 2)
                    continue;

                int payload_offset = 4;
                if (afc == 3)
                    payload_offset += 1 + ts[4];
                if (payload_offset >= 188)
                    continue;

                uint8_t *payload = &ts[payload_offset];
                int payload_len = 188 - payload_offset;

                if (pusi)
                {
                    if (payload_len >= 6 && payload[0] == 0x00 && payload[1] == 0x00 && payload[2] == 0x01)
                    {
                        if ((payload[3] & 0xF0) == 0xE0)
                        { // Video PES (0xE0 ~ 0xEF)
                            video_pid = pid;
                            int pes_header_len = 9 + payload[8];
                            if (payload_len > pes_header_len)
                            {
                                payload += pes_header_len;
                                payload_len -= pes_header_len;
                                if (!has_active_buffer && xQueueReceive(free_queue, &current_rx_frame, pdMS_TO_TICKS(50)) == pdTRUE)
                                {
                                    has_active_buffer = true;
                                }
                                if (has_active_buffer)
                                {
                                    current_frame_len = 0;
                                    frame_corrupted = false;
                                    last_video_cc = cc;
                                }
                                else
                                {
                                    frame_corrupted = true;
                                }
                            }
                            else
                                continue;
                        }
                        else if ((payload[3] & 0xE0) == 0xC0 || payload[3] == 0xBD)
                        { // Audio PES (0xC0~0xDF) 或 LPCM私有流 (0xBD)
                            if (audio_pid == 0x2000 || audio_pid == pid)
                            { // 锁定首个音频 PID
                                audio_pid = pid;
                                last_audio_cc = cc;
                                if (payload_len > 8)
                                { // 确保有足够长度读取 payload[8]
                                    int pes_header_len = 9 + payload[8];
                                    if (payload_len > pes_header_len)
                                    {
                                        payload += pes_header_len;
                                        payload_len -= pes_header_len;
                                        if (g_audio_enable)
                                        {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
                                            size_t bytes_written = 0;
                                            i2s_channel_write(tx_chan, payload, payload_len, &bytes_written, pdMS_TO_TICKS(10));
#else
                                            size_t bytes_written = 0;
                                            i2s_write(I2S_NUM_0, payload, payload_len, &bytes_written, pdMS_TO_TICKS(10));
#endif
                                        }
                                    }
                                }
                            }
                        }
                    }
                }

                if (pid == video_pid && has_active_buffer && !frame_corrupted)
                {
                    if (!pusi)
                    {
                        int expected_cc = (last_video_cc + 1) & 0x0F;
                        if (cc != expected_cc)
                        {
                            ESP_LOGW("PLAY", "Video packet drop! Expected CC %d, got %d.", expected_cc, cc);
                            frame_corrupted = true;
                        }
                        last_video_cc = cc;
                    }
                    if (!frame_corrupted)
                    {
                        if (current_frame_len + payload_len <= FRAME_BUF_SIZE)
                        {
                            memcpy(current_rx_frame.buf_ptr + current_frame_len, payload, payload_len);
                            current_frame_len += payload_len;
                            if (current_frame_len >= 2 && current_rx_frame.buf_ptr[current_frame_len - 2] == 0xFF && current_rx_frame.buf_ptr[current_frame_len - 1] == 0xD9)
                            {
                                current_rx_frame.len = current_frame_len;
                                if (xQueueSend(jpeg_queue, &current_rx_frame, 0) == pdTRUE)
                                {
                                    has_active_buffer = false;
                                }
                                frame_corrupted = true;
                            }
                        }
                        else
                        {
                            ESP_LOGW("PLAY", "Video frame overflow!");
                            frame_corrupted = true;
                        }
                    }
                }
                if (pid == audio_pid && !pusi)
                {
                    int expected_cc = (last_audio_cc + 1) & 0x0F;
                    if (cc != expected_cc)
                    {
                        ESP_LOGW("PLAY", "Audio packet drop! Expected CC %d, got %d.", expected_cc, cc);
                    }
                    if (g_audio_enable)
                    {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
                        size_t bytes_written = 0;
                        i2s_channel_write(tx_chan, payload, payload_len, &bytes_written, pdMS_TO_TICKS(10));
#else
                        size_t bytes_written = 0;
                        i2s_write(I2S_NUM_0, payload, payload_len, &bytes_written, pdMS_TO_TICKS(10));
#endif
                    }
                    last_audio_cc = cc;
                }
            }
        }

        fclose(f);
        g_sd_file_size = 0;
        g_sd_current_pos = 0;
        if (has_active_buffer)
        {
            xQueueSend(free_queue, &current_rx_frame, 0);
        }
        ESP_LOGI("PLAY", "Playback finished.");
        g_is_playing_from_sd = false;
    }
    free(file_read_buf);
    vTaskDelete(NULL);
}

