NNdroid/esp32s3-remote-display/main/main.c
void video_receiver_task(void *pvParameters)
{
    int rcv_buf_size = 65536;
    struct timeval timeout = {.tv_sec = 1, .tv_usec = 0};

    uint8_t *read_buf = (uint8_t *)malloc(4096); // 改用堆内存并增大到 4KB，防止 Jumbo Frame 或合并的 UDP 包被截断
    if (!read_buf) {
        ESP_LOGE("UDP", "Alloc failed");
        vTaskDelete(NULL);
    }

    while (1)
    {
        if (g_is_playing_from_sd)
        {
            // SD card playback is active, pause network reception.
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

        xEventGroupWaitBits(s_wifi_event_group, WIFI_CONNECTED_BIT, pdFALSE, pdTRUE, portMAX_DELAY);
        // 改為 AF_INET6
        int sock = socket(AF_INET6, SOCK_DGRAM, IPPROTO_IP);
        if (sock < 0)
        {
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }

        // 關閉 IPV6_V6ONLY，開啟 Dual Stack (雙棧) 模式，使其能同時接收 IPv4 與 IPv6 推流
        int v6only = 0;
        setsockopt(sock, IPPROTO_IPV6, IPV6_V6ONLY, &v6only, sizeof(v6only));

        setsockopt(sock, SOL_SOCKET, SO_RCVBUF, &rcv_buf_size, sizeof(rcv_buf_size));
        setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

        // 使用 sockaddr_in6 結構體
        struct sockaddr_in6 dest_addr = {0};
        dest_addr.sin6_family = AF_INET6;
        dest_addr.sin6_port = htons(g_udp_port);
        dest_addr.sin6_addr = in6addr_any; // in6addr_any 同時包含 0.0.0.0 與 ::

        if (bind(sock, (struct sockaddr *)&dest_addr, sizeof(dest_addr)) < 0)
        {
            close(sock);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }

        uint32_t current_frame_len = 0;
        rx_frame_t current_rx_frame;
        bool has_active_buffer = false;

        // TS 解析狀態變數
        uint16_t video_pid = 0x2000; // 初始無效 PID
        int8_t last_cc = -1;
        bool frame_corrupted = true; // 預設丟棄，直到看見新幀的起點

        while (1)
        {
            // 同时监听 SD 卡播放状态，一旦开始播放立刻跳出内层循环让出网络和队列资源
            if ((xEventGroupGetBits(s_wifi_event_group) & WIFI_CONNECTED_BIT) == 0 || g_is_playing_from_sd)
                break;

            // 接收 UDP 數據
            int len = recvfrom(sock, read_buf, 4096, 0, NULL, NULL);

            if (len > 0)
            {
                g_rx_bytes_1s += len;

                // 遍歷 UDP 封包內的每一個 188 Bytes TS 封包
                for (int offset = 0; offset <= len - 188; offset += 188)
                {
                    uint8_t *ts = &read_buf[offset];

                    // TS 同步字節檢查
                    if (ts[0] != 0x47)
                        continue;

                    uint16_t pid = ((ts[1] & 0x1F) << 8) | ts[2];
                    uint8_t pusi = (ts[1] & 0x40) >> 6; // Payload Unit Start Indicator (新幀開始標誌)
                    uint8_t afc = (ts[3] & 0x30) >> 4;  // Adaptation Field Control
                    uint8_t cc = ts[3] & 0x0F;          // Continuity Counter (0-15 循環)

                    if (afc == 0 || afc == 2)
                        continue; // 沒有 Payload 的包直接跳過

                    int payload_offset = 4;
                    if (afc == 3)
                    {
                        payload_offset += 1 + ts[4]; // 跳過 Adaptation Field
                    }
                    if (payload_offset >= 188)
                        continue;

                    uint8_t *payload = &ts[payload_offset];
                    int payload_len = 188 - payload_offset;

                    // 如果是新的一幀 (PES Packet Start)
                    if (pusi)
                    {
                        // 尋找影片 PES Header (0x00 0x00 0x01 0xE0)
                        if (payload_len >= 9 && payload[0] == 0x00 && payload[1] == 0x00 && payload[2] == 0x01 && payload[3] == 0xE0)
                        {
                            video_pid = pid; // 自動鎖定影片軌的 PID

                        // 【关键修复】如果上一帧因为结尾有 padding (填充字符) 导致 FF D9 判断失败，在这里利用 PUSI (新帧开始) 补救提交！
                        if (has_active_buffer && !frame_corrupted && current_frame_len > 1024)
                        {
                            current_rx_frame.len = current_frame_len;
                            if (xQueueSend(jpeg_queue, &current_rx_frame, 0) == pdTRUE)
                            {
                                has_active_buffer = false;
                            }
                        }

                            // 跳過 PES Header (通常是 9 Bytes + 附加長度)
                            int pes_header_len = 9 + payload[8];
                            if (payload_len > pes_header_len)
                            {
                                payload += pes_header_len;
                                payload_len -= pes_header_len;

                                // 準備新的緩衝區
                                if (!has_active_buffer)
                                {
                                    if (xQueueReceive(free_queue, &current_rx_frame, 0) == pdTRUE)
                                    {
                                        has_active_buffer = true;
                                    }
                                }

                                // 如果成功拿到緩衝區，才開始接收新幀
                                if (has_active_buffer)
                                {
                                    current_frame_len = 0;
                                    frame_corrupted = false;
                                    last_cc = cc;
                                }
                                else
                                {
                                    frame_corrupted = true;
                                }
                            }
                            else
                            {
                                continue;
                            }
                        }
                    }

                    // 處理鎖定的視訊流資料
                    if (pid == video_pid && has_active_buffer)
                    {
                        // 檢查丟包 (連續性計數器)
                        if (!pusi)
                        {
                            int expected_cc = (last_cc + 1) & 0x0F;
                            if (cc != expected_cc)
                            {
                                ESP_LOGW("TS", "Packet drop detected! Expected CC %d, got %d. Dropping frame.", expected_cc, cc);
                                g_video_packet_drop_count++; // 累加视频丢包计数
                                frame_corrupted = true; // 發生丟包，標記此幀為損壞，硬體安全了！
                            }
                            last_cc = cc;
                        }

                        // 如果這幀完美無缺，就將數據拷貝到 PSRAM
                        if (!frame_corrupted)
                        {
                            if (current_frame_len + payload_len <= FRAME_BUF_SIZE)
                            {
                                memcpy(current_rx_frame.buf_ptr + current_frame_len, payload, payload_len);
                                current_frame_len += payload_len;

