NNdroid/esp32s3-remote-display/main/main.c
                                // 快速偵測 JPEG 結尾 (FF D9)，一旦出現立刻送入解碼器，降低延遲
                                if (current_frame_len >= 2 &&
                                    current_rx_frame.buf_ptr[current_frame_len - 2] == 0xFF &&
                                    current_rx_frame.buf_ptr[current_frame_len - 1] == 0xD9)
                                {

                                    current_rx_frame.len = current_frame_len;
                                    if (xQueueSend(jpeg_queue, &current_rx_frame, 0) == pdTRUE)
                                    {
                                        has_active_buffer = false;
                                    }
                                    else
                                    {
                                        // 队列满，丢弃这帧的数据，复位指针等待下一帧 PUSI
                                        current_frame_len = 0;
                                    }
                                    // 幀已經送出，等待下一個 PUSI 到來
                                    frame_corrupted = true;
                                }
                            }
                            else
                            {
                                ESP_LOGW("TS", "Frame overflow > %d Bytes!", FRAME_BUF_SIZE);
                                frame_corrupted = true; // 超出緩衝區，放棄此幀
                            }
                        }
                    }
                }
            }
            else if (errno != EAGAIN && errno != EWOULDBLOCK)
            {
                ESP_LOGE("UDP", "Socket error: %d", errno);
                vTaskDelay(pdMS_TO_TICKS(100));
                break; // 修复：必须跳出内层循环，以便正确 close(sock) 重建套接字
            }
        }

        if (has_active_buffer)
        {
            xQueueSend(free_queue, &current_rx_frame, 0);
            has_active_buffer = false;
        }
        close(sock);
    }
    free(read_buf);
}

// ==================== Web 路由处理器 ====================
static bool is_authenticated(httpd_req_t *req)
{
    return true; // Direct LAN Web UI access without cookie redirect loops
}

static esp_err_t login_get_handler(httpd_req_t *req)
{
    const size_t html_size = (login_html_end - login_html_start);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, (const char *)login_html_start, html_size);
    return ESP_OK;
}

static esp_err_t do_login_handler(httpd_req_t *req)
{
    char buf[150];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char user_enc[64], pwd_enc[128];
        if (httpd_query_key_value(buf, "user", user_enc, sizeof(user_enc)) == ESP_OK && 
            httpd_query_key_value(buf, "pwd", pwd_enc, sizeof(pwd_enc)) == ESP_OK)
        {
            char user[32], pwd[64];
            url_decode_safe(user, user_enc, sizeof(user));
            url_decode_safe(pwd, pwd_enc, sizeof(pwd));

            if (strcmp(user, g_admin_user) == 0 && strcmp(pwd, g_admin_pwd) == 0)
            {
                httpd_resp_set_hdr(req, "Set-Cookie", "session=esp32_admin; Path=/; Max-Age=86400");
                httpd_resp_set_status(req, "302 Found");
                httpd_resp_set_hdr(req, "Location", "/");
                httpd_resp_send(req, NULL, 0);
                return ESP_OK;
            }
        }
    }
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "/login?err=1");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t do_restart_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, "{\"success\":true,\"message\":\"device will restart...\"}", HTTPD_RESP_USE_STRLEN);
    vTaskDelay(pdMS_TO_TICKS(1000));
    esp_restart();
    return ESP_OK;
}

static esp_err_t index_get_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "302 Found");
        httpd_resp_set_hdr(req, "Location", "/login");
        httpd_resp_send(req, NULL, 0);
        return ESP_OK;
    }
    const size_t html_size = (index_html_end - index_html_start);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, (const char *)index_html_start, html_size);
    return ESP_OK;
}

static esp_err_t api_ota_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }
    esp_ota_handle_t update_handle = 0;
    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    if (esp_ota_begin(update_partition, OTA_SIZE_UNKNOWN, &update_handle) != ESP_OK)
    {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    char *buf = malloc(1024);
    if (!buf)
    {
        esp_ota_abort(update_handle);
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    int remaining = req->content_len;
    esp_err_t err = ESP_OK;

    while (remaining > 0)
    {
        int received = httpd_req_recv(req, buf, MIN(remaining, 1024));
        if (received <= 0)
        {
            err = ESP_FAIL;
            break;
        }
        esp_ota_write(update_handle, buf, received);
        remaining -= received;
    }

    free(buf);

    if (err != ESP_OK)
    {
        esp_ota_end(update_handle);
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    esp_ota_end(update_handle);
    esp_ota_set_boot_partition(update_partition);
    httpd_resp_send(req, "{\"success\":true,\"message\":\"update successful, device will restart...\"}", HTTPD_RESP_USE_STRLEN);
    vTaskDelay(pdMS_TO_TICKS(1000));
    esp_restart();
    return ESP_OK;
}

static esp_err_t api_version_handler(httpd_req_t *req)
{
    char json_resp[128];
    snprintf(json_resp, sizeof(json_resp), "{\"fw_ver\":\"%s\"}", PROJECT_VER);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_data_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    char current_ssid[33] = "Not Connected";
    wifi_config_t wifi_cfg;
    if (esp_wifi_get_config(WIFI_IF_STA, &wifi_cfg) == ESP_OK)
    {
        if (wifi_cfg.sta.ssid[0] != '\0')
            strncpy(current_ssid, (char *)wifi_cfg.sta.ssid, sizeof(current_ssid) - 1);
    }
    char json_resp[1400]; // 扩展容量以容纳文件位置和网络丢包信息
    uint64_t sd_total = 0, sd_free = 0;
    if (g_sd_card_mounted)
    {
        esp_vfs_fat_info(MOUNT_POINT, &sd_total, &sd_free);
    }

    snprintf(json_resp, sizeof(json_resp),
             "{\"ssid\":\"%s\",\"rssi\":%d,\"fps\":%d,\"brightness\":%ld,\"volume\":%ld,\"osd\":%d,\"time_osd\":%d,\"user\":\"%s\",\"ip\":\"%s\",\"ip6\":\"%s\",\"timezone\":\"%s\",\"udp_port\":%ld,\"rgb_r\":%d,\"rgb_g\":%d,\"rgb_b\":%d,\"sd_mounted\":%d,\"sd_playing\":%d,\"sd_total_mb\":%lu,\"sd_free_mb\":%lu,\"audio\":%d,\"bat_mv\":%d,\"bat_pct\":%d,\"sd_pos\":%lu,\"sd_size\":%lu,\"sd_file\":\"%s\",\"fw_ver\":\"%s\",\"audio_plc\":%lu,\"video_drop\":%lu,\"mirror_x\":%d,\"mirror_y\":%d,\"auto_sleep\":%d,\"chime\":%d,\"alarm\":%d,\"alarm_h\":%d,\"alarm_m\":%d}",
             current_ssid, g_current_rssi, g_current_fps, g_current_brightness, g_current_volume, g_show_osd, g_show_time_osd, g_admin_user, g_device_ip, g_device_ip6, g_timezone, g_udp_port, g_rgb_r, g_rgb_g, g_rgb_b, g_sd_card_mounted, g_is_playing_from_sd, (unsigned long)(sd_total / 1048576), (unsigned long)(sd_free / 1048576), g_audio_enable, g_battery_voltage_mv, g_battery_percentage, (unsigned long)g_sd_current_pos, (unsigned long)g_sd_file_size, s_playback_filename, PROJECT_VER, (unsigned long)g_audio_plc_count, (unsigned long)g_video_packet_drop_count, g_mirror_x, g_mirror_y, g_auto_sleep_enable, g_hourly_chime_enable, g_alarm_enable, g_alarm_hour, g_alarm_min);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_set_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

