NNdroid/esp32s3-remote-display/main/main.c
    char buf[256];
    bool need_restart = false;

    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char param[64];
        char save_str[8] = {0};
        int save = 1; // 默认保存，兼容老调用
        if (httpd_query_key_value(buf, "save", save_str, sizeof(save_str)) == ESP_OK)
        {
            save = atoi(save_str);
        }

        if (httpd_query_key_value(buf, "brightness", param, sizeof(param)) == ESP_OK)
        {
            int32_t br = atoi(param);
            if (br < 0)
                br = 0;
            if (br > 100)
                br = 100;
            g_current_brightness = br;
            if (save)
            {
                save_int_to_nvs("brightness", br);
            }
            ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, (br * 255) / 100);
            ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
        }
        if (httpd_query_key_value(buf, "volume", param, sizeof(param)) == ESP_OK)
        {
            int32_t vol = atoi(param);
            if (vol < 0)
                vol = 0;
            if (vol > 100)
                vol = 100;
            g_current_volume = vol;
            if (save)
            {
                save_int_to_nvs("volume", vol);
            }
            uint8_t vol_reg = vol == 0 ? 0 : ((vol * 256 / 100) - 1);
            es8311_write_reg(0x32, vol_reg);
        }
        if (httpd_query_key_value(buf, "osd", param, sizeof(param)) == ESP_OK)
        {
            g_show_osd = (atoi(param) == 1) ? 1 : 0;
            save_i8_to_nvs("show_osd", g_show_osd);
        }
        if (httpd_query_key_value(buf, "time", param, sizeof(param)) == ESP_OK)
        {
            g_show_time_osd = (atoi(param) == 1) ? 1 : 0;
            save_i8_to_nvs("show_time", g_show_time_osd);
        }
        if (httpd_query_key_value(buf, "audio", param, sizeof(param)) == ESP_OK)
        {
            g_audio_enable = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("audio_enable", g_audio_enable);
            }
            gpio_set_level(PA_EN_PIN, g_audio_enable ? 0 : 1);
        }
        if (httpd_query_key_value(buf, "mirror_x", param, sizeof(param)) == ESP_OK)
        {
            g_mirror_x = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("mirror_x", g_mirror_x);
            }
        }
        if (httpd_query_key_value(buf, "mirror_y", param, sizeof(param)) == ESP_OK)
        {
            g_mirror_y = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("mirror_y", g_mirror_y);
            }
        }
        if (httpd_query_key_value(buf, "auto_sleep", param, sizeof(param)) == ESP_OK)
        {
            g_auto_sleep_enable = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("auto_sleep", g_auto_sleep_enable);
            }
            wake_up_display();
        }
        if (httpd_query_key_value(buf, "chime", param, sizeof(param)) == ESP_OK)
        {
            g_hourly_chime_enable = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("hourly_chime", g_hourly_chime_enable);
            }
        }
        if (httpd_query_key_value(buf, "alarm", param, sizeof(param)) == ESP_OK)
        {
            g_alarm_enable = (atoi(param) == 1) ? 1 : 0;
            if (save)
            {
                save_i8_to_nvs("alarm_enable", g_alarm_enable);
            }
        }
        if (httpd_query_key_value(buf, "alarm_time", param, sizeof(param)) == ESP_OK)
        {
            int h = 0, m = 0;
            if (sscanf(param, "%d:%d", &h, &m) == 2)
            {
                g_alarm_hour = h;
                g_alarm_min = m;
                if (save)
                {
                    save_i8_to_nvs("alarm_h", g_alarm_hour);
                    save_i8_to_nvs("alarm_m", g_alarm_min);
                }
            }
        }
        if (httpd_query_key_value(buf, "timezone", param, sizeof(param)) == ESP_OK)
        {
            char decoded_tz[32];
            url_decode_safe(decoded_tz, param, sizeof(decoded_tz));
            strncpy(g_timezone, decoded_tz, sizeof(g_timezone) - 1);
            g_timezone[sizeof(g_timezone) - 1] = '\0';
            setenv("TZ", g_timezone, 1);
            tzset();
            save_str_to_nvs("tz_str", g_timezone);
        }

        if (httpd_query_key_value(buf, "udp_port", param, sizeof(param)) == ESP_OK)
        {
            int32_t port = atoi(param);
            if (g_udp_port != port && port > 0 && port < 65536)
            {
                g_udp_port = port;
                save_int_to_nvs("udp_port", port);
                need_restart = true;
            }
        }
    }

    if (need_restart)
    {
        httpd_resp_send(req, "RESTART", HTTPD_RESP_USE_STRLEN);
        vTaskDelay(pdMS_TO_TICKS(1000));
        esp_restart();
        return ESP_OK;
    }

    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_rgb_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    char buf[128];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char r_str[8] = {0}, g_str[8] = {0}, b_str[8] = {0}, save_str[8] = {0};
        if (httpd_query_key_value(buf, "r", r_str, sizeof(r_str)) == ESP_OK &&
            httpd_query_key_value(buf, "g", g_str, sizeof(g_str)) == ESP_OK &&
            httpd_query_key_value(buf, "b", b_str, sizeof(b_str)) == ESP_OK)
        {
            int save = 1; // 默认保存，兼容老调用
            if (httpd_query_key_value(buf, "save", save_str, sizeof(save_str)) == ESP_OK)
            {
                save = atoi(save_str);
            }

            if (s_led_strip)
            {
                g_rgb_r = atoi(r_str);
                g_rgb_g = atoi(g_str);
                g_rgb_b = atoi(b_str);
                led_strip_set_pixel(s_led_strip, 0, g_rgb_r, g_rgb_g, g_rgb_b);
                led_strip_refresh(s_led_strip);

                if (save)
                {
                    save_u8_to_nvs("rgb_r", g_rgb_r);
                    save_u8_to_nvs("rgb_g", g_rgb_g);
                    save_u8_to_nvs("rgb_b", g_rgb_b);
                }
            }
        }
    }
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_account_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    char buf[200];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char new_user_enc[64], new_pwd_enc[128];
        if (httpd_query_key_value(buf, "user", new_user_enc, sizeof(new_user_enc)) == ESP_OK &&
            httpd_query_key_value(buf, "pwd", new_pwd_enc, sizeof(new_pwd_enc)) == ESP_OK)
        {
            url_decode_safe(g_admin_user, new_user_enc, sizeof(g_admin_user));
            url_decode_safe(g_admin_pwd, new_pwd_enc, sizeof(g_admin_pwd));
            save_str_to_nvs("admin_user", g_admin_user);
            save_str_to_nvs("admin_pwd", g_admin_pwd);
        }
    }
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_wifi_reset_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    network_prov_mgr_reset_wifi_provisioning();
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    vTaskDelay(pdMS_TO_TICKS(1500));
    esp_restart();
    return ESP_OK;
}

