NNdroid/esp32s3-remote-display/main/main.c
static esp_err_t api_sd_format_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    if (!g_sd_card_mounted)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "SD Card not mounted", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    if (esp_vfs_fat_sdcard_format(MOUNT_POINT, s_card) == ESP_OK)
    {
        httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    }
    else
    {
        ESP_LOGE("SD", "Format failed, unmounting card.");
        esp_vfs_fat_sdcard_unmount(MOUNT_POINT, s_card);
        g_sd_card_mounted = false;
        httpd_resp_set_status(req, "500 Internal Server Error");
        httpd_resp_send(req, "Format failed", HTTPD_RESP_USE_STRLEN);
    }
    return ESP_OK;
}

static esp_err_t api_sd_play_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        return httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
    }
    if (g_is_playing_from_sd)
    {
        httpd_resp_set_status(req, "409 Conflict");
        return httpd_resp_send(req, "Already playing a file.", HTTPD_RESP_USE_STRLEN);
    }

    char buf[200];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char file_param[128];
        if (httpd_query_key_value(buf, "file", file_param, sizeof(file_param)) == ESP_OK)
        {
            url_decode_safe(s_playback_filename, file_param, sizeof(s_playback_filename));
            if (strchr(s_playback_filename, '/') != NULL || strchr(s_playback_filename, '\\') != NULL)
            {
                httpd_resp_set_status(req, "400 Bad Request");
                return httpd_resp_send(req, "Invalid filename", HTTPD_RESP_USE_STRLEN);
            }
            xTaskNotifyGive(s_sd_playback_task_handle);
            return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
        }
    }
    httpd_resp_set_status(req, "400 Bad Request");
    return httpd_resp_send(req, "File parameter missing", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t api_sd_stop_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        return httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
    }
    if (g_is_playing_from_sd)
    {
        g_stop_playback = true;
        // Wait a moment for the task to acknowledge the stop signal
        for (int i = 0; i < 10 && g_is_playing_from_sd; i++)
        {
            vTaskDelay(pdMS_TO_TICKS(100));
        }
    }
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_sd_pause_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        return httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
    }
    if (g_is_playing_from_sd)
    {
        g_pause_playback = true;
    }
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_sd_resume_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        return httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
    }
    if (g_is_playing_from_sd)
    {
        g_pause_playback = false;
    }
    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t api_sd_seek_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        return httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
    }
    if (!g_is_playing_from_sd)
    {
        return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    }
    char buf[64];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char val_str[16];
        if (httpd_query_key_value(buf, "val", val_str, sizeof(val_str)) == ESP_OK)
        {
            int val = atoi(val_str);
            if (val < 0)
                val = 0;
            if (val > 1000)
                val = 1000;
            g_seek_permille = val;
        }
    }
    return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t api_sd_delete_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    if (!g_sd_card_mounted)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "SD Card not mounted", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    char buf[128];
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        char file_param[64];
        if (httpd_query_key_value(buf, "file", file_param, sizeof(file_param)) == ESP_OK)
        {
            char decoded_file[64];
            url_decode_safe(decoded_file, file_param, sizeof(decoded_file));

            // 防止跨目录攻击
            if (strchr(decoded_file, '/') != NULL || strchr(decoded_file, '\\') != NULL)
            {
                httpd_resp_set_status(req, "400 Bad Request");
                httpd_resp_send(req, "Invalid filename", HTTPD_RESP_USE_STRLEN);
                return ESP_OK;
            }

            char filepath[128];
            snprintf(filepath, sizeof(filepath), "%s/%s", MOUNT_POINT, decoded_file);

            if (unlink(filepath) == 0)
            {
                return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
            }
            else
            {
                ESP_LOGE("SD", "Failed to delete file %s", filepath);
                // Check if the card is still there.
                uint64_t total, free;
                if (esp_vfs_fat_info(MOUNT_POINT, &total, &free) != ESP_OK)
                {
                    ESP_LOGE("SD", "Card inaccessible after delete failure. Unmounting.");
                    esp_vfs_fat_sdcard_unmount(MOUNT_POINT, s_card);
                    g_sd_card_mounted = false;
                }
            }
        }
    }

    httpd_resp_set_status(req, "500 Internal Server Error");
    httpd_resp_send(req, "Delete failed", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

