NNdroid/esp32s3-remote-display/main/main.c
static esp_err_t api_sd_eject_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    if (!g_sd_card_mounted)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "SD Card not mounted", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    // If playing, stop it first
    if (g_is_playing_from_sd)
        g_stop_playback = true;

    if (esp_vfs_fat_sdcard_unmount(MOUNT_POINT, s_card) == ESP_OK)
    {
        g_sd_card_mounted = false;
        return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    }

    httpd_resp_set_status(req, "500 Internal Server Error");
    return httpd_resp_send(req, "Eject failed", HTTPD_RESP_USE_STRLEN);
}

static esp_err_t api_files_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    // Try to ensure the card is mounted before proceeding.
    sd_card_init();

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send_chunk(req, "[", 1);

    DIR *dir = opendir(MOUNT_POINT);
    if (dir)
    {
        struct dirent *entry;
        bool first = true;
        char buf[512];
        while ((entry = readdir(dir)) != NULL)
        {
            if (entry->d_type == DT_REG)
            {
                char filepath[300];
                snprintf(filepath, sizeof(filepath), "%s/%s", MOUNT_POINT, entry->d_name);
                struct stat st;
                if (stat(filepath, &st) == 0)
                {
                    snprintf(buf, sizeof(buf), "%s{\"name\":\"%s\",\"size\":%ld}",
                             first ? "" : ",", entry->d_name, (long)st.st_size);
                    httpd_resp_send_chunk(req, buf, strlen(buf));
                    first = false;
                }
            }
        }
        closedir(dir);
    }
    httpd_resp_send_chunk(req, "]", 1);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t api_sd_upload_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }
    if (!g_sd_card_mounted)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "SD Card not mounted", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }

    char buf[128];
    char file_param[64] = {0};
    if (httpd_req_get_url_query_str(req, buf, sizeof(buf)) == ESP_OK)
    {
        httpd_query_key_value(buf, "file", file_param, sizeof(file_param));
    }

    if (strlen(file_param) == 0)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "Filename missing", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }

    char decoded_file[64];
    url_decode_safe(decoded_file, file_param, sizeof(decoded_file));
    if (strchr(decoded_file, '/') != NULL || strchr(decoded_file, '\\') != NULL)
    {
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_send(req, "Invalid filename", HTTPD_RESP_USE_STRLEN);
        return ESP_FAIL;
    }

    char filepath[128];
    snprintf(filepath, sizeof(filepath), "%s/%s", MOUNT_POINT, decoded_file);

    FILE *f = fopen(filepath, "wb");
    if (!f)
    {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    char *data_buf = malloc(4096);
    if (!data_buf)
    {
        fclose(f);
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    int remaining = req->content_len;
    esp_err_t err = ESP_OK;

    while (remaining > 0)
    {
        int received = httpd_req_recv(req, data_buf, MIN(remaining, 4096));
        if (received < 0)
        {
            if (received == HTTPD_SOCK_ERR_TIMEOUT)
            {
                // 超时重试
                continue;
            }
            err = ESP_FAIL;
            break;
        }
        else if (received == 0)
        {
            err = ESP_FAIL;
            break;
        }
        if (fwrite(data_buf, 1, received, f) != received)
        {
            err = ESP_FAIL;
            break;
        }
        remaining -= received;

        // 让出 CPU
        vTaskDelay(pdMS_TO_TICKS(1));
    }

    free(data_buf);
    fclose(f);

    if (err != ESP_OK)
    {
        unlink(filepath); // 删除不完整的文件
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}



static esp_err_t sd_file_download_handler(httpd_req_t *req)
{
    if (!is_authenticated(req))
    {
        httpd_resp_set_status(req, "401 Unauthorized");
        httpd_resp_send(req, "Unauthorized", HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }
    char filepath[128];
    strlcpy(filepath, req->uri, sizeof(filepath));

    // 移除 URL 可能附带的 Query Params
    char *q = strchr(filepath, '?');
    if (q)
        *q = '\0';

    FILE *f = fopen(filepath, "r");
    if (!f)
        return httpd_resp_send_404(req);

    httpd_resp_set_type(req, "video/x-motion-jpeg");

    char *chunk = malloc(8192);
    if (!chunk)
    {
        fclose(f);
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    size_t read_bytes;
    while ((read_bytes = fread(chunk, 1, 8192, f)) > 0)
    {
        if (httpd_resp_send_chunk(req, chunk, read_bytes) != ESP_OK)
        {
            fclose(f);
            free(chunk);
            return ESP_FAIL;
        }
    }
    fclose(f);
    free(chunk);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.max_uri_handlers = 30;
    config.max_open_sockets = 5;
    config.lru_purge_enable = true;
    config.stack_size = 6144;
    config.recv_wait_timeout = 5;
    config.send_wait_timeout = 5;
    config.uri_match_fn = httpd_uri_match_wildcard;
    httpd_handle_t server = NULL;
    esp_err_t err = httpd_start(&server, &config);
    if (err != ESP_OK)
    {
        ESP_LOGE("WEB", "Failed to start HTTP Web Server! err=0x%x (%s)", err, esp_err_to_name(err));
        return NULL;
    }
    ESP_LOGI("WEB", "HTTP Web Server started successfully on port 80");
    if (true)
    {
        httpd_uri_t index_uri = {.uri = "/", .method = HTTP_GET, .handler = index_get_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &index_uri);
        httpd_uri_t login_uri = {.uri = "/login", .method = HTTP_GET, .handler = login_get_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &login_uri);
        httpd_uri_t do_login_uri = {.uri = "/do_login", .method = HTTP_GET, .handler = do_login_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &do_login_uri);
        httpd_uri_t api_version_uri = {.uri = "/api/version", .method = HTTP_GET, .handler = api_version_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_version_uri);
        httpd_uri_t api_data_uri = {.uri = "/api/data", .method = HTTP_GET, .handler = api_data_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_data_uri);
        httpd_uri_t api_set_uri = {.uri = "/api/set", .method = HTTP_GET, .handler = api_set_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_set_uri);
        httpd_uri_t api_rgb_uri = {.uri = "/api/rgb", .method = HTTP_GET, .handler = api_rgb_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_rgb_uri);
        httpd_uri_t api_acc_uri = {.uri = "/api/account", .method = HTTP_GET, .handler = api_account_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_acc_uri);
        httpd_uri_t api_wifi_reset_uri = {.uri = "/api/wifi_reset", .method = HTTP_POST, .handler = api_wifi_reset_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_wifi_reset_uri);
        httpd_uri_t ota_uri = {.uri = "/api/ota", .method = HTTP_POST, .handler = api_ota_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &ota_uri);
        httpd_uri_t sd_format_uri = {.uri = "/api/sd_format", .method = HTTP_POST, .handler = api_sd_format_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_format_uri);
        httpd_uri_t do_restart_uri = {.uri = "/api/restart", .method = HTTP_POST, .handler = do_restart_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &do_restart_uri);
        httpd_uri_t api_files_uri = {.uri = "/api/files", .method = HTTP_GET, .handler = api_files_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_files_uri);
        httpd_uri_t api_sd_delete_uri = {.uri = "/api/sd_delete", .method = HTTP_POST, .handler = api_sd_delete_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_sd_delete_uri);
        httpd_uri_t sd_eject_uri = {.uri = "/api/sd_eject", .method = HTTP_POST, .handler = api_sd_eject_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_eject_uri);
        httpd_uri_t sd_play_uri = {.uri = "/api/sd_play", .method = HTTP_POST, .handler = api_sd_play_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_play_uri);
        httpd_uri_t sd_stop_uri = {.uri = "/api/sd_stop", .method = HTTP_POST, .handler = api_sd_stop_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_stop_uri);
        httpd_uri_t sd_pause_uri = {.uri = "/api/sd_pause", .method = HTTP_POST, .handler = api_sd_pause_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_pause_uri);
        httpd_uri_t sd_resume_uri = {.uri = "/api/sd_resume", .method = HTTP_POST, .handler = api_sd_resume_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_resume_uri);
        httpd_uri_t sd_seek_uri = {.uri = "/api/sd_seek", .method = HTTP_POST, .handler = api_sd_seek_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_seek_uri);
        httpd_uri_t api_sd_upload_uri = {.uri = "/api/sd_upload", .method = HTTP_POST, .handler = api_sd_upload_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &api_sd_upload_uri);
        httpd_uri_t sd_file_uri = {.uri = "/sdcard/*", .method = HTTP_GET, .handler = sd_file_download_handler, .user_ctx = NULL};
        httpd_register_uri_handler(server, &sd_file_uri);
    }

    return server;
}

void time_sync_notification_cb(struct timeval *tv) {}

void init_time_sync(void)
{
    esp_sntp_setoperatingmode(SNTP_OPMODE_POLL);
    esp_sntp_setservername(0, "pool.ntp.org");
    esp_sntp_setservername(1, "time.stdtime.gov.tw");
    esp_sntp_setservername(2, "time.windows.com");
    sntp_set_time_sync_notification_cb(time_sync_notification_cb);
    esp_sntp_servermode_dhcp(1);
    esp_sntp_init();
    setenv("TZ", g_timezone, 1);
    tzset();
}

