NNdroid/esp32s3-remote-display/main/main.c
void app_main(void)
{
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // 使用官方通用标准方法注册多核通用的空闲钩子函数
    esp_register_freertos_idle_hook(vApplicationIdleHookCore);

    // 静默等待 50ms 让开机状态机稳定，随后精准测定 200ms 内的纯空闲最大计数值基准
    vTaskDelay(pdMS_TO_TICKS(50));
    g_core0_idle_cnt = 0;
    g_core1_idle_cnt = 0;
    vTaskDelay(pdMS_TO_TICKS(200));

    g_core0_max_idle = g_core0_idle_cnt;
    g_core1_max_idle = g_core1_idle_cnt;

    if (g_core0_max_idle == 0)
        g_core0_max_idle = 1;
    if (g_core1_max_idle == 0)
        g_core1_max_idle = 1;

    // 輸入端緩衝區使用硬體對齊分配 API，徹底滿足 SIMD 向量運算胃口
    for (int i = 0; i < RX_BUF_NUM; i++)
    {
        rx_frame_buf[i] = (uint8_t *)heap_caps_aligned_alloc(16, FRAME_BUF_SIZE, MALLOC_CAP_SPIRAM);
        if (!rx_frame_buf[i])
        {
            rx_frame_buf[i] = (uint8_t *)heap_caps_aligned_alloc(16, FRAME_BUF_SIZE, MALLOC_CAP_8BIT);
            if (!rx_frame_buf[i])
            {
                ESP_LOGE("MEM", "Fatal: Failed to allocate rx_frame_buf[%d]!", i);
            }
        }
    }

    // 显示缓冲区分配在外部 PSRAM 中，释放全部内部 DRAM 给 Wi-Fi 驱动、LWIP 协议栈与 WebServer Socket！
    for (int i = 0; i < DISPLAY_BUF_NUM; i++)
    {
        display_buf[i] = (uint8_t *)heap_caps_aligned_alloc(16, (LCD_PIXELS + LCD_WIDTH * 16) * 2, MALLOC_CAP_SPIRAM);
        if (!display_buf[i])
        {
            display_buf[i] = (uint8_t *)heap_caps_aligned_alloc(16, (LCD_PIXELS + LCD_WIDTH * 16) * 2, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (!display_buf[i])
            {
                ESP_LOGE("MEM", "Fatal: Failed to allocate display_buf[%d]!", i);
            }
        }
    }

    jpeg_queue = xQueueCreate(RX_BUF_NUM, sizeof(rx_frame_t));
    free_queue = xQueueCreate(RX_BUF_NUM, sizeof(rx_frame_t));

    for (int i = 0; i < RX_BUF_NUM; i++)
    {
        rx_frame_t empty_frame = {.buf_ptr = rx_frame_buf[i], .len = 0};
        xQueueSend(free_queue, &empty_frame, 0);
    }

    ESP_ERROR_CHECK(esp_netif_init());
    s_wifi_event_group = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    esp_netif_t *sta_netif = esp_netif_create_default_wifi_sta();
    if (sta_netif != NULL)
    {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        char hostname[32];
        snprintf(hostname, sizeof(hostname), "ESP32-RX-%02X%02X%02X", mac[3], mac[4], mac[5]);
        esp_netif_set_hostname(sta_netif, hostname);
        ESP_LOGI("WIFI", "Device Hostname set to: %s", hostname);
    }

    ESP_ERROR_CHECK(esp_event_handler_register(NETWORK_PROV_EVENT, ESP_EVENT_ANY_ID, &sys_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &sys_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, ESP_EVENT_ANY_ID, &sys_event_handler, NULL));

    lcd_hardware_init();
    sd_card_init();
    audio_hardware_init();
    battery_adc_init();
    rgb_led_init();
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    network_prov_mgr_config_t config_prov = {.scheme = network_prov_scheme_ble, .scheme_event_handler = NETWORK_PROV_EVENT_HANDLER_NONE};
    ESP_ERROR_CHECK(network_prov_mgr_init(config_prov));

    bool provisioned = false;
    ESP_ERROR_CHECK(network_prov_mgr_is_wifi_provisioned(&provisioned));

    xTaskCreatePinnedToCore(jpeg_decode_display_task, "jpeg_task", 8192, NULL, 10, NULL, 1);
    xTaskCreatePinnedToCore(sd_playback_task, "sd_playback", 8192, NULL, 8, &s_sd_playback_task_handle, 0);

    if (!provisioned)
    {
        g_is_provisioning = true;
        network_prov_scheme_ble_set_service_uuid(g_prov_uuid);
        ESP_ERROR_CHECK(network_prov_mgr_start_provisioning(NETWORK_PROV_SECURITY_1, (const void *)g_prov_pop, "PROV_DISPLAY", NULL));
    }
    else
    {
        network_prov_mgr_deinit();
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11N));
        ESP_ERROR_CHECK(esp_wifi_start());
    }

    // 提前拉起网络收发任务，无需在 app_main 中死等 Wi-Fi
    xTaskCreatePinnedToCore(audio_receiver_task, "audio_task", 8192, NULL, 12, NULL, 0); // 堆栈由 4096 扩大到 8192 防止溢出
    xTaskCreatePinnedToCore(video_receiver_task, "video_task", 8192, NULL, 10, NULL, 0);

    bool webserver_started = false;
    TickType_t last_scan_time = 0;
    while (1)
    {
        vTaskDelay(pdMS_TO_TICKS(1000));

        // 首次连接成功 Wi-Fi 后按需启动 WebServer 与 SNTP 时间同步，解绑主循环
        if (!webserver_started && (xEventGroupGetBits(s_wifi_event_group) & WIFI_CONNECTED_BIT))
        {
            webserver_started = true;
            esp_wifi_set_ps(WIFI_PS_NONE);
            init_time_sync();
            start_webserver();
            ESP_LOGI("WEB", "Web server started on port 80");
        }
        // 5s 扫描一次 WiFi 信号强度和剩余内存，并根据情况触发 WiFi 扫描以更新附近 AP 列表
        if (xTaskGetTickCount() - last_scan_time >= pdMS_TO_TICKS(5000))
        {
            g_async_free_heap_kb = esp_get_free_heap_size() / 1024;
            wifi_ap_record_t ap_info;
            if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK)
            {
                g_async_wifi_rssi = ap_info.rssi;
                snprintf((char *)g_async_wifi_bssid, sizeof(g_async_wifi_bssid), "%02X:%02X:%02X:%02X:%02X:%02X",
                         ap_info.bssid[0], ap_info.bssid[1], ap_info.bssid[2], ap_info.bssid[3], ap_info.bssid[4], ap_info.bssid[5]);

                TickType_t now_tick = xTaskGetTickCount();
                // 仅在网络空闲 (接收速度 < 50KB/s) 时才允许自动漫游扫描，绝对避免打断正在进行的视频流
                if (ap_info.rssi < -75 && now_tick - last_scan_time >= pdMS_TO_TICKS(30000) && g_current_rx_speed_kbps < 50)
                {
                    wifi_scan_config_t scan_config = {0};
                    scan_config.ssid = ap_info.ssid;
                    if (esp_wifi_scan_start(&scan_config, false) == ESP_OK)
                        last_scan_time = now_tick;
                }
            }
            else
            {
                g_async_wifi_rssi = 0;
                g_async_wifi_bssid[0] = '\0';
            }
        }

        // 3s扫描一次电池电压
        static TickType_t last_battery_scan_time = 0;
        if (adc1_handle && xTaskGetTickCount() - last_battery_scan_time >= pdMS_TO_TICKS(3000))
        {
            last_battery_scan_time = xTaskGetTickCount();
            int adc_raw = 0;
            if (adc_oneshot_read(adc1_handle, ADC_CHANNEL_8, &adc_raw) == ESP_OK)
            {
                int voltage_mv = 0;
                if (do_calibration)
                {
                    adc_cali_raw_to_voltage(adc1_cali_handle, adc_raw, &voltage_mv);
                }
                else
                {
                    voltage_mv = adc_raw;
                }
                int real_mv = voltage_mv * 2;
                g_battery_voltage_mv = real_mv;
                int pct = (real_mv - 3300) * 100 / (4200 - 3300);
                if (pct > 100)
                    pct = 100;
                if (pct < 0)
                    pct = 0;
                g_battery_percentage = pct;
            }
        }
        g_current_rx_speed_kbps = g_rx_bytes_1s / 1024;
        g_rx_bytes_1s = 0;
    }
}